[{"id":"cmcduqne80006ik04s4yqs0bo","userId":"cmcdub5al0000ik04owx3yyry","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume lacks strong quantifiable results.","While many projects are listed, the impact of the candidate's contributions is not clearly articulated.","The descriptions of projects often focus on tasks performed rather than the outcomes achieved."],"createdAt":"2025-06-26 20:44:50.289"},{"id":"cmcdus509000dik04a3iw8n5z","userId":"cmcdub5al0000ik04owx3yyry","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume lacks sufficient quantification of achievements in each role.","For example, instead of stating \"Improved retention,\" the candidate should specify the percentage improvement in retention rates.","The descriptions of projects could benefit from more detail on the specific AI/ML techniques used, the challenges faced, and the solutions implemented."],"createdAt":"2025-06-26 20:45:59.769"},{"id":"cmch3u8zr0006l704qfyvrzvx","userId":"cmch3tgzx0000l704d6ymox5e","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume lacks specific quantifiable results in many sections.","Instead of simply stating tasks completed, the candidate should quantify their impact using metrics such as percentage improvements, cost savings, or efficiency gains.","The descriptions of projects could be improved by focusing more on the technical challenges overcome and the innovative solutions implemented."],"createdAt":"2025-06-29 03:22:53.32"},{"id":"cmckz5mor0006jx041tts38a3","userId":"cmckz4k110000jx04ofae86cr","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume lacks strong quantifiable results.","Many accomplishments are described qualitatively rather than quantitatively.","For example, instead of stating \"boosting query resolution efficiency by 20%,\" the resume should specify the metrics used to measure this improvement, such as \"reduced average query resolution time from X seconds to Y seconds.\"  The descriptions of the personal projects could be significantly enhanced by quantifying their impact and scale."],"createdAt":"2025-07-01 20:22:50.908"},{"id":"cmckz6ncw0008jx04nzol8m2k","userId":"cmckz4k110000jx04ofae86cr","type":"resume","score":78,"duration":10,"completed":true,"improvements":["The resume lacks strong quantification of achievements.","Instead of simply stating tasks, the candidate should quantify the impact of their work using metrics like increased efficiency, cost savings, or improved performance.","The descriptions of projects are detailed, but could benefit from a more concise and results-oriented approach."],"createdAt":"2025-07-01 20:23:38.432"},{"id":"cmckzrwn3000ajx04zwb8o6bl","userId":"cmckz4k110000jx04ofae86cr","type":"resume","score":88,"duration":9,"completed":true,"improvements":["The resume could benefit from a more concise and impactful presentation of the projects section.","The description of personal projects could be improved by highlighting the technical challenges overcome and the innovative solutions implemented.","While the resume mentions quantifiable results, further emphasizing the business impact of these achievements would enhance its effectiveness."],"createdAt":"2025-07-01 20:40:10.239"},{"id":"cmcl0io550001k404s61nwkmx","userId":"cmckz4k110000jx04ofae86cr","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume lacks strong quantifiable results.","Many accomplishments are described qualitatively (\"boosting efficiency,\" \"enhancing accuracy\") without specific metrics.","The descriptions of projects could benefit from a more structured approach, focusing on the candidate's individual contributions and their impact on the project's success."],"createdAt":"2025-07-01 21:00:58.937"},{"id":"cmcl6gn300003jp046r95r8vc","userId":"cmckz4k110000jx04ofae86cr","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume lacks a strong focus on quantifiable results.","Many achievements are described qualitatively, without specific numbers or metrics to demonstrate their impact.","The resume could benefit from a more concise and focused summary of skills and experience."],"createdAt":"2025-07-01 23:47:21.948"},{"id":"cmcm3y8wx0003le047yq59swu","userId":"cmbsq3hf10000jw042tqot71k","type":"resume","score":78,"duration":13,"completed":true,"improvements":["The resume lacks specific quantification of achievements in many instances.","For example, instead of stating \"increasing user engagement by 25%,\" the resume should specify the metrics used to measure engagement and provide the baseline numbers.","The descriptions of projects could be significantly improved by explicitly detailing the candidate's full-stack contributions."],"createdAt":"2025-07-02 15:24:50.722"},{"id":"cmcprpz4l0006le04qbmgbj3o","userId":"cmcproki10000le04vxn8ank5","type":"resume","score":75,"duration":7,"completed":true,"improvements":["The resume lacks a strong emphasis on quantifiable results.","Many project descriptions mention tasks completed but do not quantify the impact or success using metrics.","The descriptions could benefit from more specific details about the technical challenges faced and how they were overcome."],"createdAt":"2025-07-05 04:53:34.102"},{"id":"cmcprri6i0001l80485habtmm","userId":"cmcproki10000le04vxn8ank5","type":"resume","score":78,"duration":5,"completed":true,"improvements":["The resume lacks strong quantifiable results in many project descriptions.","While the projects are impressive, the impact of each project needs to be clearly articulated with specific metrics.","For example, instead of stating \"achieved a 46% reduction in inference time,\" the resume should mention the specific impact of this reduction, such as \"Reduced inference time by 46%, resulting in a 20% increase in model throughput and a 15% reduction in processing costs.\"  The descriptions of the candidate's roles need to be more result-oriented, focusing on the value delivered to the employer."],"createdAt":"2025-07-05 04:54:45.45"},{"id":"cmcqckkdd0001lb04sumsif72","userId":"cmcproki10000le04vxn8ank5","type":"resume","score":55,"duration":11,"completed":true,"improvements":["The resume lacks any experience or skills directly related to product engineering, such as design, development, testing, manufacturing, or deployment of products.","There is no mention of any engineering coursework or projects.","The candidate's background is primarily in business analytics, which is a significantly different field."],"createdAt":"2025-07-05 14:37:13.633"},{"id":"cmcr62ker0008l704tzsjr0cy","userId":"cmcr61kof0002l7049cajxw52","type":"resume","score":75,"duration":9,"completed":true,"improvements":["The resume lacks specific examples showcasing high-performance computing skills, distributed systems experience, or knowledge of financial markets – all highly relevant to Optiver.","Quantifiable results in projects are insufficient; while awards are mentioned, the impact of the projects needs to be explicitly stated with numbers, percentages, or other metrics.","The resume could benefit from stronger keywords relevant to quantitative finance and high-frequency trading."],"createdAt":"2025-07-06 04:23:02.355"},{"id":"cmcriky3i0006jy049b3ypr2i","userId":"cmcrifdmo0000jy0425mheq5n","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume lacks strong quantification of accomplishments.","Many achievements are described qualitatively rather than quantitatively.","For example, instead of \"reducing error resolution time by 50%,\" the resume could specify the number of errors reduced or the time saved in concrete terms."],"createdAt":"2025-07-06 10:13:15.294"},{"id":"cmcw5nzux0001l704fljz6f4s","userId":"cmcw5kzzs0000l704cryvgloz","type":"resume","score":70,"duration":11,"completed":true,"improvements":["The resume lacks a clear and concise summary of the candidate's skills and experience.","Quantifiable achievements are underrepresented; the impact of projects needs to be more clearly articulated with specific metrics.","The resume heavily focuses on personal projects, with limited emphasis on professional experience."],"createdAt":"2025-07-09 16:10:33.417"},{"id":"cmcw84wad0001jm04alwo0wny","userId":"cmckz4k110000jx04ofae86cr","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume lacks strong quantifiable results.","While it mentions percentage improvements, the impact of these improvements is not clearly articulated.","The descriptions of projects and experiences are too general and lack specific details about the challenges faced and solutions implemented."],"createdAt":"2025-07-09 17:19:41.174"},{"id":"cmcwpde4d000vld04sqm8al8n","userId":"cmcwpcik6000pld04l869yj86","type":"resume","score":88,"duration":14,"completed":true,"improvements":["The resume could benefit from stronger quantification of results, especially in terms of model performance metrics and business impact.","The candidate should elaborate on the specific challenges faced and overcome in each project or internship.","The resume should include more details about the model deployment process and the tools used for monitoring and maintenance."],"createdAt":"2025-07-10 01:22:11.005"},{"id":"cmcwptwhr0001lb044ryruuvh","userId":"cmcwppz4n001bld04nk4xkg75","type":"resume","score":82,"duration":14,"completed":true,"improvements":["The professional summary could be more targeted to specific job descriptions, highlighting the most relevant skills and experiences.","Quantifiable achievements should be emphasized more consistently throughout the professional experience section.","The resume could benefit from more detail on the specific contributions made to each project, particularly in terms of code quality, testing, and deployment."],"createdAt":"2025-07-10 01:35:01.311"},{"id":"cmcwqpr3c000gld04ryq0sjcf","userId":"cmcwqhzgl0005ld04i641jz0g","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume lacks specific quantifiable results for many achievements, such as the impact of the AI integration or the reduction in technical debt.","The \"Profile\" section is generic and could be more targeted to the specific Senior Software Engineer role being applied for.","The resume could benefit from highlighting experience with specific software development methodologies and tools currently in high demand, such as specific testing frameworks."],"createdAt":"2025-07-10 01:59:47.304"},{"id":"cmcwr2i5o000sld04jxa134ib","userId":"cmcwr0o1f000mld046957tj68","type":"resume","score":82,"duration":10,"completed":true,"improvements":["The summary could be more impactful by explicitly stating the types of problems the candidate enjoys solving and the specific industries they are interested in.","More context around the projects and the specific challenges overcome would strengthen the impact of the experience section.","While the resume mentions several technologies, it lacks depth in explaining how these technologies were used to solve specific problems."],"createdAt":"2025-07-10 02:09:42.253"},{"id":"cmcwsq65a0008ju04wb5wp7y9","userId":"cmcwspaf30002ju04qcxqij1u","type":"resume","score":80,"duration":13,"completed":true,"improvements":["The resume lacks quantifiable results in the experience section; adding metrics would significantly strengthen it.","The descriptions of the projects could be more concise and focused on the specific challenges and solutions implemented.","The resume should emphasize experience with high-volume, low-latency systems, which are critical for a payment platform like PhonePe."],"createdAt":"2025-07-10 02:56:06.047"},{"id":"cmcwt658f000fju04hpcx8r8u","userId":"cmcwsj77y001nld04dd82x9zp","type":"resume","score":65,"duration":6,"completed":true,"improvements":["The resume lacks specific examples of product ownership or contributions to product strategy.","The candidate should quantify achievements related to user engagement, conversion rates, or other key product metrics.","The resume needs to demonstrate a deeper understanding of the product development lifecycle beyond just coding."],"createdAt":"2025-07-10 03:08:31.359"},{"id":"cmcwt7j47000hju04irv8dd2z","userId":"cmcwsj77y001nld04dd82x9zp","type":"resume","score":68,"duration":13,"completed":true,"improvements":["The resume lacks quantifiable results for most accomplishments, making it difficult to assess the candidate's impact.","The descriptions of projects and responsibilities are too generic and need to be more specific and results-oriented.","The resume needs more detail about the types of problems solved and the impact of the solutions implemented."],"createdAt":"2025-07-10 03:09:36.007"},{"id":"cmcwu2lx9001vju04uevldwkz","userId":"cmcwtycyj001fju04n4gwyeb6","type":"resume","score":78,"duration":12,"completed":true,"improvements":["The resume needs more specific examples of backend development projects and their impact.","It would be beneficial to elaborate on the scale and complexity of the systems the candidate has worked on.","The description of the ERP system implementation could be strengthened by detailing the backend technologies used and the specific challenges addressed."],"createdAt":"2025-07-10 03:33:45.982"},{"id":"cmcwwbamv000gju04e16ryqce","userId":"cmcww8l9d000aju0416nfqifb","type":"resume","score":78,"duration":10,"completed":true,"improvements":["The resume lacks a clear focus on frontend-specific accomplishments within the experience section, as some descriptions lean towards backend or full-stack responsibilities.","Project descriptions could be enhanced by explicitly stating the frontend challenges addressed and the solutions implemented using specific frontend technologies.","The resume would benefit from highlighting contributions to user experience (UX) and user interface (UI) design, which are crucial for Frontend Developers."],"createdAt":"2025-07-10 04:36:30.487"},{"id":"cmcwyapag001aju048fvr7m2u","userId":"cmcwy9saz0014ju04iqkl4g7u","type":"resume","score":78,"duration":10,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's contributions.","The descriptions of projects and experiences should emphasize business outcomes and efficiency gains.","The resume should explicitly mention experience with testing methodologies and frameworks."],"createdAt":"2025-07-10 05:32:02.057"},{"id":"cmcwyld00001mju04mqk5a3dh","userId":"cmcwykmbg001gju04fhoawtsy","type":"resume","score":82,"duration":5,"completed":true,"improvements":["The resume could benefit from more quantifiable results, such as the number of users impacted by specific features or the cost savings achieved through performance improvements.","While DevOps experience is mentioned, the resume could elaborate on specific DevOps practices implemented, such as infrastructure-as-code or continuous integration/continuous deployment pipelines.","The candidate should provide more details about the architectural patterns and design principles used in backend development projects."],"createdAt":"2025-07-10 05:40:19.344"},{"id":"cmcwyn2ga001oju040uv0lnt7","userId":"cmcwykmbg001gju04fhoawtsy","type":"resume","score":82,"duration":11,"completed":true,"improvements":["The resume could benefit from more quantifiable metrics to demonstrate the impact of the candidate's work, such as cost savings, performance improvements, or increased efficiency.","More details about the specific problems solved and the technologies used in each project would enhance the resume's impact.","While the resume mentions various technologies, it lacks depth in explaining how these technologies were used to solve specific business problems."],"createdAt":"2025-07-10 05:41:38.987"},{"id":"cmcx0x9ft000dl804rbwlqiue","userId":"cmcx0urf90007l804bq3cksgn","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The internship experience description could be more detailed, quantifying the impact of the automated tool and the benefits of standardizing time-zone data.","The project descriptions should focus more on the challenges faced and the solutions implemented, rather than just stating the technologies used.","The \"Achievements, Awards, and Extracurricular Activities\" section is less relevant to the Software Engineer role and could be shortened or refocused."],"createdAt":"2025-07-10 06:45:33.834"},{"id":"cmcx1tgrm000pl804qahz6zz8","userId":"cmcx1qyjj000jl804qcv0vay1","type":"resume","score":80,"duration":9,"completed":true,"improvements":["The resume could benefit from explicitly stating experience working with large datasets, aligning with the job description's emphasis on big data.","The descriptions of projects should more clearly articulate the problem being solved and the specific challenges overcome.","The resume could include more specific examples of problem-solving skills beyond the listed interest."],"createdAt":"2025-07-10 07:10:36.322"},{"id":"cmcx1wxd6000rl804n3zdkj4i","userId":"cmcx1qyjj000jl804qcv0vay1","type":"resume","score":82,"duration":11,"completed":true,"improvements":["The resume could benefit from a clearer statement of career goals or a brief summary highlighting the candidate's key skills and interests.","While the projects are impressive, explicitly mentioning experience with optimizing performance for large datasets would be beneficial.","Adding more detail about the specific problem-solving skills used in each project would further strengthen the application."],"createdAt":"2025-07-10 07:13:17.802"},{"id":"cmcx1yfum000tl8045vsgbn58","userId":"cmcx1qyjj000jl804qcv0vay1","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume lacks specific examples of working with large datasets, which is a key requirement for this role.","The candidate should quantify the impact of their projects whenever possible, such as the number of users, data processed, or efficiency improvements.","The resume should include more details about the technologies used in each project and their specific contributions."],"createdAt":"2025-07-10 07:14:28.414"},{"id":"cmcx299a20010l804g3a30af8","userId":"cmcx27d3u000ul804596wpyyx","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's contributions.","The descriptions of projects and work experience could benefit from more specific details about the challenges faced and the solutions implemented.","The resume could be improved by adding more details about the software development lifecycle and methodologies used in projects."],"createdAt":"2025-07-10 07:22:53.114"},{"id":"cmcx4dd2i0010ky04y9bi15uz","userId":"cmcx4cjvb000uky04o4y42lx7","type":"resume","score":82,"duration":5,"completed":true,"improvements":["The resume could benefit from more quantifiable results to showcase the impact of the candidate's work on each project.","The descriptions of project responsibilities are somewhat generic; they should be more specific and highlight unique contributions.","The \"Academic Achievements and Awards\" section could be integrated into the project descriptions or a separate \"Achievements\" section for better emphasis."],"createdAt":"2025-07-10 08:22:03.882"},{"id":"cmcx67qc2002eky04bllzt8q4","userId":"cmcx65zej0028ky04f31pjtku","type":"resume","score":78,"duration":12,"completed":true,"improvements":["The resume could benefit from more detailed descriptions of the technologies used in each project, specifying versions where possible.","The \"Achievements\" section is somewhat generic and could be better integrated into the work experience or project sections to showcase how these achievements benefited specific projects or employers.","The resume should include a brief summary or objective statement at the beginning to clearly state the candidate's career goals and key qualifications."],"createdAt":"2025-07-10 09:13:40.371"},{"id":"cmcx72lof002vky04ouo537jo","userId":"cmcx70x1p002pky0457gpxxgw","type":"resume","score":75,"duration":9,"completed":true,"improvements":["The resume needs more quantifiable results to showcase the impact of the candidate's work in previous roles.","The description of projects lacks detail about the architecture, technologies used, and the candidate's specific contributions.","While Stibo STEP is mentioned, the resume needs to demonstrate broader experience in full-stack development beyond a specific MDM framework."],"createdAt":"2025-07-10 09:37:40.671"},{"id":"cmcx7h4740006jv048ccgkkjn","userId":"cmcx7g2hd0000jv0421mc38jf","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume should quantify achievements with more specific metrics beyond percentage improvements.","The descriptions of projects and experiences could benefit from more detail about the specific challenges faced and the solutions implemented.","The \"Operations Team Lead\" experience is less relevant to a Software Engineer role and should be minimized or reframed to emphasize transferable skills."],"createdAt":"2025-07-10 09:48:57.857"},{"id":"cmcx7lq1m000djv04b03g7axw","userId":"cmcx7kjrt0007jv04q5uqzfrs","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume lacks specific examples of problem-solving skills used in project development.","It would benefit from mentioning specific Google technologies or platforms the candidate is familiar with.","The \"Technical Skills and Tools\" section is too broad and needs to be more targeted towards Google's tech stack."],"createdAt":"2025-07-10 09:52:32.794"},{"id":"cmcx7mrf4000fjv04em8upuuk","userId":"cmcx7kjrt0007jv04q5uqzfrs","type":"resume","score":75,"duration":9,"completed":true,"improvements":["The resume lacks specific details about contributions to larger projects or open-source initiatives.","The descriptions of technical skills are generic and lack specific examples of their application.","The resume should include more details about the design decisions and challenges faced during project development."],"createdAt":"2025-07-10 09:53:21.232"},{"id":"cmcx8k6sf000ujv041rzj04be","userId":"cmcx8j791000ojv04ze3rfs8n","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume could benefit from more quantifiable results, such as specific performance improvements or user engagement metrics.","While the projects are well-described, the impact of the candidate's contributions could be emphasized further.","The resume needs more focus on skills and experiences directly relevant to Amazon's focus areas, like distributed systems, scalability, and cloud technologies (AWS)."],"createdAt":"2025-07-10 10:19:20.799"},{"id":"cmcxar45a001njv046romt23c","userId":"cmcxaoqp0001hjv04hh4kfxhf","type":"resume","score":82,"duration":13,"completed":true,"improvements":["The resume could benefit from more specific examples of problem-solving in complex, large-scale environments typical of Google, Meta, Apple, Oracle, or Netflix.","While the resume mentions leading teams, it lacks detail on the size and composition of those teams and the specific leadership responsibilities.","The candidate should provide more context around the business impact of their technical contributions, such as revenue generation, cost savings, or user growth."],"createdAt":"2025-07-10 11:20:43.199"},{"id":"cmcxaxqhk001pjv04vlhz6zv0","userId":"cmcxaoqp0001hjv04hh4kfxhf","type":"resume","score":88,"duration":5,"completed":true,"improvements":["The resume could benefit from more explicitly stating the specific backend development tasks performed, rather than focusing solely on DevOps aspects.","While the resume mentions cloud infrastructure management, it could be strengthened by detailing the specific backend services and APIs the candidate has worked with.","The resume could be enhanced by emphasizing the candidate's experience with database design, optimization, and querying."],"createdAt":"2025-07-10 11:25:52.089"},{"id":"cmcxb2ayd001rjv04i1h3a0eq","userId":"cmcxaoqp0001hjv04hh4kfxhf","type":"resume","score":88,"duration":7,"completed":true,"improvements":["The resume should include more specific details about the size and complexity of the infrastructure managed.","The candidate could include more details about specific security tools and practices implemented beyond vulnerability reduction.","While the resume mentions Git, it could benefit from highlighting experience with specific Git workflows and branching strategies."],"createdAt":"2025-07-10 11:29:25.238"},{"id":"cmcxb64sg001yjv040mgcusdh","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume could benefit from more detailed descriptions of the projects, including the specific technologies used and the challenges overcome.","The descriptions of the projects could include specific metrics to quantify the impact of the project.","The achievements listed under the work experience section should be more concise and focus on the most impactful contributions."],"createdAt":"2025-07-10 11:32:23.872"},{"id":"cmcxbphg20025jv04xfio3tde","userId":"cmcxbjk0b001zjv04wiko2df3","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume lacks specific details regarding the scale and complexity of projects, such as the number of users or transactions handled.","The descriptions of responsibilities are somewhat generic and could benefit from more specific details of the candidate’s contributions and impact.","The resume could benefit from showcasing experience with architectural design patterns, system optimization, or leading technical initiatives."],"createdAt":"2025-07-10 11:47:26.739"},{"id":"cmcxbshyx0027jv04zbbcu64j","userId":"cmcxbjk0b001zjv04wiko2df3","type":"resume","score":78,"duration":13,"completed":true,"improvements":["The resume lacks quantifiable results in several areas, making it difficult to assess the impact of the candidate's work.","The summary could be more targeted to the specific requirements of a Senior Software Engineer role, emphasizing leadership and mentorship abilities.","The descriptions of previous roles could benefit from more detail about the complexity of the projects and the candidate's specific contributions."],"createdAt":"2025-07-10 11:49:47.386"},{"id":"cmcxbzbk70029jv04jva0re9h","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":82,"duration":10,"completed":true,"improvements":["The resume could benefit from more specific details about the technical challenges overcome in each project.","The descriptions of the projects need more technical depth, specifically detailing the architecture and implementation details.","The resume could benefit from a stronger emphasis on version control practices and code quality."],"createdAt":"2025-07-10 11:55:05.672"},{"id":"cmcxcp9h80001k104v6fjswcl","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume could benefit from more specific details about the technologies used in each project and their impact on the overall system architecture.","Quantifying the impact of the AI-Powered Career Advancement Tool and the Machine Learning project would strengthen the resume.","While the resume lists several technologies, it lacks specifics on the candidate's depth of knowledge in each area."],"createdAt":"2025-07-10 12:15:16.028"},{"id":"cmcxcwvky0003k104y0gdl1f9","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume could benefit from more specific details about the architecture and design of the backend systems the candidate worked on.","The descriptions of the projects could be more focused on the backend aspects and the technologies used.","The resume should include more details about the candidate's experience with testing methodologies and tools beyond just mentioning \"Automated Test Suites.\" There is a lack of explicit mention of cloud deployment strategies and experience with specific cloud platforms beyond AWS."],"createdAt":"2025-07-10 12:21:11.266"},{"id":"cmcxd0vzs0005k104ubni9dgi","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":78,"duration":10,"completed":true,"improvements":["The resume lacks specific details about the technologies used in the AI-powered project; elaborating on the specific libraries and algorithms used would strengthen this section.","The bullet points in the work experience section could benefit from more context and technical details to demonstrate the complexity of the tasks.","The description of the Machine Learning project is somewhat vague and could benefit from more specific information about the models used and the results achieved."],"createdAt":"2025-07-10 12:24:18.425"},{"id":"cmcxd8ukc0007k104vehyw84c","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume could benefit from more specific details about the technologies used in each project and their impact.","The project descriptions lack quantifiable results, making it difficult to assess the candidate's impact.","The \"Fundamentals\" section is broad; consider integrating these concepts into project or work experience descriptions."],"createdAt":"2025-07-10 12:30:29.82"},{"id":"cmcxexn9z000tk104niri6u8y","userId":"cmcxekg5m000nk1043g37s0i0","type":"resume","score":82,"duration":12,"completed":true,"improvements":["The profile section could be more targeted towards the specific type of Backend Developer role being sought, detailing preferred domains and specific technologies.","While the resume mentions technologies, it lacks depth regarding specific architectural patterns or design principles used.","The description of responsibilities could be enhanced by including more context about the challenges faced and the solutions implemented."],"createdAt":"2025-07-10 13:17:46.392"},{"id":"cmcxfdbxe0010k10465h9fdf5","userId":"cmcxfb87w000uk1047stqmihr","type":"resume","score":80,"duration":14,"completed":true,"improvements":["The resume could benefit from more concrete examples of designing and implementing scalable systems to handle large volumes of data.","While cloud experience is present, further detailing specific cloud services used and their impact would be beneficial.","The resume could emphasize contributions to open-source projects or personal projects that demonstrate passion for backend development."],"createdAt":"2025-07-10 13:29:58.179"},{"id":"cmcxfnuzz0017k10419njonvf","userId":"cmcxfmod50011k10417bbrm9a","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume lacks specific examples of projects where the candidate utilized their full-stack skills to solve complex problems.","The candidate should provide more details about the technologies used in each project and the specific contributions made.","The resume could benefit from a more prominent summary or profile section highlighting key skills and experience relevant to a Full Stack Developer role."],"createdAt":"2025-07-10 13:38:09.455"},{"id":"cmcxhvrdg000ljl05ba4wmcdr","userId":"cmcxhus1x000fjl05r2t020u1","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume lacks quantifiable results for the projects, making it difficult to assess the impact of the candidate's contributions.","The \"Work Experience\" section, while relevant, is limited to an internship, suggesting a need for more substantial professional experience in AI/ML.","The resume could benefit from a more detailed explanation of the models used, the datasets involved, and the evaluation metrics achieved in the AI/ML projects."],"createdAt":"2025-07-10 14:40:17.237"},{"id":"cmcxjf30l0017jl05f2gxbrq7","userId":"cmcxj9e1r000rjl056jmjw60s","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The profile section is generic and needs to be tailored to the specific Backend Developer role at Google.","The resume lacks quantifiable results, such as performance improvements or cost savings, achieved through their work.","The description of responsibilities is too general and should focus on concrete accomplishments."],"createdAt":"2025-07-10 15:23:18.405"},{"id":"cmcxjgoan0019jl05kerbivpf","userId":"cmcxjbvq1000wjl051dko4d5a","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume lacks explicit mention of QA methodologies, testing frameworks, or specific testing types (e.g., unit, integration, system, performance).","The resume should quantify the impact of improvements or optimizations achieved through testing or automation efforts.","The description of projects lacks direct relevance to QA engineering, and should be tailored to highlight transferable skills."],"createdAt":"2025-07-10 15:24:32.64"},{"id":"cmcxjgocp001bjl05zk169d1k","userId":"cmcxj9e1r000rjl056jmjw60s","type":"resume","score":78,"duration":10,"completed":true,"improvements":["The resume lacks specific details regarding the size and scale of the applications developed.","There is a need to quantify the impact of improvements made, such as performance enhancements or cost reductions.","The resume does not explicitly mention experience with distributed systems, microservices architecture, or containerization technologies like Docker and Kubernetes, which are commonly used at Google."],"createdAt":"2025-07-10 15:24:32.713"},{"id":"cmcxk29wg001sjl05998iopc7","userId":"cmcxjowlh001mjl05o73hz1m1","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume lacks quantifiable results, such as specific performance improvements or user engagement metrics.","The technology stack used in each role should be explicitly listed.","The resume should include information about the size and scale of the applications developed."],"createdAt":"2025-07-10 15:41:20.417"},{"id":"cmcxlhu06000bl7044vnbpjfp","userId":"cmcxlgu1p0005l704x3uy78a4","type":"resume","score":78,"duration":13,"completed":true,"improvements":["The professional summary could be more targeted towards specific company needs or projects.","The resume does not specify the types of applications the candidate has built, limiting its impact.","The candidate should elaborate on the specific responsibilities held during the Frontend Developer Intern position."],"createdAt":"2025-07-10 16:21:25.927"},{"id":"cmcxln5jk000il704al4ub1i7","userId":"cmcxlmagu000cl704zs26yf0n","type":"resume","score":78,"duration":13,"completed":true,"improvements":["The descriptions of accomplishments in the \"Experience\" section should be more quantifiable, including specific metrics to demonstrate impact.","The resume could benefit from showcasing problem-solving skills by explicitly stating the challenges faced and the solutions implemented in projects.","The \"Technical Skills\" section should be more organized and potentially categorized by proficiency level (e.g., proficient, familiar)."],"createdAt":"2025-07-10 16:25:34.16"},{"id":"cmcxlrgki000ul704r6fgzv6p","userId":"cmcxlnsdb000jl704lrw584j6","type":"resume","score":65,"duration":9,"completed":true,"improvements":["The resume lacks quantifiable results and specific achievements related to data engineering tasks, such as data pipeline development, ETL processes, or data warehousing.","The descriptions of projects are too high-level and do not provide enough detail about the technical challenges faced and solutions implemented.","The resume needs more focus on data-specific aspects of the projects."],"createdAt":"2025-07-10 16:28:55.074"},{"id":"cmcxlstre0011l704wicloo2z","userId":"cmcxlnsdb000jl704lrw584j6","type":"resume","score":65,"duration":9,"completed":true,"improvements":["The resume lacks quantifiable achievements and specific examples of how the listed skills were applied to solve data-related problems.","The projects described are vague and do not provide enough detail about the data pipelines, data transformations, or data storage solutions implemented.","The \"Profile Summary\" is too generic and does not highlight the candidate's passion for data or specific career goals in Data Engineering."],"createdAt":"2025-07-10 16:29:58.827"},{"id":"cmcxltkpn0013l704y2x8ydty","userId":"cmcxlsgz1000vl704jnv049bn","type":"resume","score":78,"duration":13,"completed":true,"improvements":["The resume lacks quantifiable achievements and metrics to demonstrate the impact of the candidate's work.","The descriptions of the internship experiences are too general and do not provide specific details about the candidate's contributions.","The resume needs to emphasize the candidate's understanding of web performance optimization techniques."],"createdAt":"2025-07-10 16:30:33.755"},{"id":"cmcxmajka001al70436qchpwu","userId":"cmcxm98ud0014l704rmxlc81z","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's work in previous roles.","The descriptions of projects and experiences should be more focused on the business problem solved and the value delivered.","While the resume lists many skills, it lacks depth in showcasing expertise in specific areas relevant to data science, like deep learning or specific statistical modeling techniques."],"createdAt":"2025-07-10 16:43:45.419"},{"id":"cmcxmcv9j001cl704dqxmh6d6","userId":"cmcxm98ud0014l704rmxlc81z","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's work, for example, by specifying the number of users impacted by a feature or the performance improvement achieved.","The descriptions of projects and experiences should explicitly highlight the full-stack aspects of the work, such as the interaction between front-end and back-end components.","The resume lacks specific examples of how the candidate has used their skills to solve complex problems or contribute to business goals."],"createdAt":"2025-07-10 16:45:33.895"},{"id":"cmcxmx6y70008kw04qilzw2br","userId":"cmcxmvw5d0002kw04e5s8w089","type":"resume","score":82,"duration":8,"completed":true,"improvements":["The resume lacks specific details on the scale and complexity of the infrastructure managed.","The candidate should provide more context about the size of the teams they worked with and the impact of their contributions on larger projects.","The descriptions of projects could be more detailed, explaining the business problem solved and the technologies used in more depth."],"createdAt":"2025-07-10 17:01:22.159"},{"id":"cmcxn6npy000fkw04utmsdhfs","userId":"cmcxn5ceo0009kw04jazsgzwf","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's work.","The descriptions of past roles and projects should include specific metrics to highlight achievements.","The resume needs to emphasize problem-solving skills and the complexity of the challenges tackled."],"createdAt":"2025-07-10 17:08:43.798"},{"id":"cmcxn7lht000hkw04xtpofcug","userId":"cmcxn5ceo0009kw04jazsgzwf","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's work, especially in the experience section.","Descriptions of projects and internships should be more specific about the challenges faced and the solutions implemented.","The resume should highlight contributions to open-source projects or personal projects that demonstrate a passion for software engineering."],"createdAt":"2025-07-10 17:09:27.569"},{"id":"cmcxpixxj000vkz041iji48zf","userId":"cmcxmvw5d0002kw04e5s8w089","type":"resume","score":82,"duration":9,"completed":true,"improvements":["The resume could benefit from quantifying the impact of automation scripts on reducing manual tasks and improving efficiency.","Expanding on the specific DevOps methodologies (e.g., Agile, Scrum, Kanban) used in previous roles would strengthen the candidate's profile.","Providing more details on the specific challenges faced and overcome in previous DevOps projects would demonstrate problem-solving abilities."],"createdAt":"2025-07-10 18:14:16.136"},{"id":"cmcxpp9zf0012kz04r4gxel50","userId":"cmcxmvw5d0002kw04e5s8w089","type":"resume","score":82,"duration":7,"completed":true,"improvements":["The resume could benefit from more specific examples of cloud infrastructure design and implementation.","There is a need to emphasize experience with cloud-native technologies and architectures beyond the tools listed.","The candidate should quantify the impact of their projects and contributions in terms of cost savings, performance improvements, or scalability gains."],"createdAt":"2025-07-10 18:19:11.692"},{"id":"cmcxpqjfx0014kz045fhzgkgx","userId":"cmcxmvw5d0002kw04e5s8w089","type":"resume","score":82,"duration":6,"completed":true,"improvements":["The resume could benefit from more detailed descriptions of the specific DevOps methodologies employed in each role.","The candidate should elaborate on their experience with monitoring and alerting tools, such as Prometheus, Grafana, or Datadog.","While security experience is mentioned, the resume could be strengthened by highlighting specific security frameworks or compliance standards the candidate has worked with."],"createdAt":"2025-07-10 18:20:10.606"},{"id":"cmcxps1in0016kz042z2vebor","userId":"cmcxmvw5d0002kw04e5s8w089","type":"resume","score":82,"duration":6,"completed":true,"improvements":["The resume could benefit from more detailed descriptions of the technologies used within each project and role.","The candidate should quantify the impact of their work whenever possible, using metrics to showcase achievements.","The descriptions of projects and previous roles could be more specific about the business problems solved and the value delivered."],"createdAt":"2025-07-10 18:21:20.687"},{"id":"cmcxq7n7r001dkz04qp65ld65","userId":"cmcxmvw5d0002kw04e5s8w089","type":"resume","score":78,"duration":12,"completed":true,"improvements":["The resume needs to explicitly highlight experience in designing and building scalable and resilient platforms.","The candidate should showcase experience in platform monitoring, alerting, and incident response in more detail.","There is a need to emphasize experience with containerization technologies beyond basic Docker usage, potentially including Kubernetes or similar orchestration tools."],"createdAt":"2025-07-10 18:33:28.647"},{"id":"cmcxrhlyf001rkz04htfm3dhx","userId":"cmcxrfnhm001lkz044q9ax35k","type":"resume","score":80,"duration":10,"completed":true,"improvements":["The resume lacks quantifiable results for many projects and experiences; adding metrics would significantly strengthen the impact.","The descriptions of projects could be more detailed, explaining the problem solved and the impact of the solution.","While the skills section is good, it could benefit from listing specific areas of expertise within each technology."],"createdAt":"2025-07-10 19:09:13.191"},{"id":"cmcxtk6cp0006lb04syzwkp72","userId":"cmcxtj4by0000lb0466jrqf0o","type":"resume","score":72,"duration":9,"completed":true,"improvements":["The resume lacks quantifiable results and specific details about the impact of the candidate's contributions in both the internship and project sections.","The descriptions of projects and internships are too high-level and do not provide enough information about the technical challenges faced and overcome.","The resume should include more details about the candidate's role in each project and the technologies used."],"createdAt":"2025-07-10 20:07:12.17"},{"id":"cmcxuedz1000nlb0424v52p9a","userId":"cmcxudcyh000hlb04csmpn7i0","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume needs stronger quantification of achievements beyond the single \"10x performance increase\" statement.","The resume should emphasize backend-specific skills and technologies over frontend experience, given the target role.","More details about the scale and complexity of the APIs worked on would be valuable."],"createdAt":"2025-07-10 20:30:41.725"},{"id":"cmcxufimf000plb04r80end22","userId":"cmcxudcyh000hlb04csmpn7i0","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume needs to explicitly highlight backend-specific projects and responsibilities.","The candidate should quantify the impact of their work with specific metrics, such as reduced latency or increased throughput.","The resume lacks details on system design, scalability, and other backend-related concepts."],"createdAt":"2025-07-10 20:31:34.407"},{"id":"cmcxv5jmc0006k004yt62sz3r","userId":"cmcxv41kp0000k004gnlpvob3","type":"resume","score":78,"duration":13,"completed":true,"improvements":["The resume could benefit from more quantifiable results, such as specific performance improvements or user engagement metrics.","The descriptions of projects and experiences should be tailored to highlight skills and experiences most relevant to Google's focus areas, such as distributed systems, machine learning, or large-scale applications.","The \"LLM Trainer\" experience could be elaborated upon to showcase a deeper understanding of machine learning principles and their application in software development."],"createdAt":"2025-07-10 20:51:48.756"},{"id":"cmcxv96d70008k0044toy38qu","userId":"cmcxmvw5d0002kw04e5s8w089","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume should quantify achievements more effectively to demonstrate impact.","The candidate should highlight specific contributions to team projects and their outcomes.","The resume needs to explicitly mention experience with testing strategies and automation frameworks, which are key responsibilities."],"createdAt":"2025-07-10 20:54:38.204"},{"id":"cmcxx6p6a0006js04phhhblij","userId":"cmcxwzd610000js04dpu5gsia","type":"resume","score":78,"duration":5,"completed":true,"improvements":["The resume could benefit from more explicit connections to Amazon's customer-centric approach.","The candidate should provide more context on the scale and impact of their projects, especially in terms of users or data processed.","The descriptions of projects and experiences could be more tailored to highlight skills directly relevant to the specific job description, such as optimization and distributed systems."],"createdAt":"2025-07-10 21:48:41.843"},{"id":"cmcxx7rbv0008js04qu7an60e","userId":"cmcxwzd610000js04dpu5gsia","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume needs more emphasis on experience with distributed systems and large-scale data processing.","The candidate should quantify the impact of their projects with respect to scalability, fault tolerance, and cost reduction.","The resume would benefit from including examples of contributing to open-source projects or working on projects with a large user base."],"createdAt":"2025-07-10 21:49:31.292"},{"id":"cmcxyho5w000kjs04ei3xnwhv","userId":"cmcxxi8e70009js04r6mq6v7c","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume lacks quantifiable results to demonstrate the impact of the candidate's work, such as improvements in performance, user engagement, or code quality.","The descriptions of projects and responsibilities are somewhat generic and could be tailored to better reflect Meta's specific technology stack and challenges.","The resume could benefit from showcasing experience with specific Meta technologies or open-source projects relevant to Meta's work."],"createdAt":"2025-07-10 22:25:13.365"},{"id":"cmcxyrazx000rjs041zd3s6wj","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":78,"duration":13,"completed":true,"improvements":["The descriptions of project accomplishments should be more quantifiable and results-oriented.","The resume should elaborate on the specific contributions made to each project, especially the AI-powered career advancement tool and the machine learning project.","It would be beneficial to explain the architecture and design decisions made during the refactoring of Walmart's Returns API."],"createdAt":"2025-07-10 22:32:42.862"},{"id":"cmcxyy8qv000yjs04i5ly0h36","userId":"cmcxjbvq1000wjl051dko4d5a","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume lacks quantifiable results in several areas, such as the impact of automation efforts or the performance improvements achieved through monitoring.","The resume could be improved by highlighting specific contributions to large-scale projects or complex systems.","The resume lacks specific experience in areas like GPU programming (CUDA) or deep learning frameworks (TensorFlow, PyTorch), which are highly valued at NVIDIA."],"createdAt":"2025-07-10 22:38:06.535"},{"id":"cmcxz7gl90015js04h20x1z71","userId":"cmcxjbvq1000wjl051dko4d5a","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume lacks specific details on leading small development teams, which is a desired qualification.","The candidate should quantify the impact of their work whenever possible, providing metrics such as cost savings or performance improvements.","The resume could benefit from explicitly stating experience with testing frameworks like JUnit."],"createdAt":"2025-07-10 22:45:16.605"},{"id":"cmcy0wbge001mjs04szki1zzg","userId":"cmcy0r5uy001bjs044yk08fvu","type":"resume","score":82,"duration":13,"completed":true,"improvements":["The resume could benefit from quantifying the impact of the projects and experiences more consistently.","While some achievements are quantified (e.g., 30% increase in user engagement), others lack specific metrics.","The resume should include more details about the architecture and design decisions made during the projects, especially regarding scalability and maintainability."],"createdAt":"2025-07-10 23:32:35.966"},{"id":"cmcy2sz8j000sl704uxfs4yzc","userId":"cmcy2dilz000al7045ezv3o28","type":"resume","score":82,"duration":12,"completed":true,"improvements":["The resume could benefit from quantifying the impact of the \"Data Scientist\" role at Project 990, beyond just accuracy improvements.","The \"Data Engineering Intern\" role could be strengthened by detailing the specific business problem the AWS Lambda function addressed.","The resume should include more details on the specific types of data analyzed and the insights derived from the projects."],"createdAt":"2025-07-11 00:25:59.396"},{"id":"cmcygsqd4000bl204oogoekjl","userId":"cmcygpq4p0005l204hflyrk8q","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume needs stronger emphasis on cybersecurity-related projects and experiences, given the role within the Cyber Security group.","Quantifiable achievements related to security improvements or risk reduction should be highlighted.","The resume should explicitly mention experience with messaging brokers like Apache Kafka, as specified in the job description."],"createdAt":"2025-07-11 06:57:42.52"},{"id":"cmcygwwud000il204t8on7v0v","userId":"cmcygvued000cl2046k3m642u","type":"resume","score":78,"duration":10,"completed":true,"improvements":["The descriptions of personal projects could benefit from more detail regarding the problem being solved, the technical challenges overcome, and the overall impact of the project.","The \"Achievements\" section should be strengthened by quantifying accomplishments and highlighting their relevance to software engineering.","The resume could benefit from showcasing experience with testing frameworks or methodologies, a crucial aspect of software development."],"createdAt":"2025-07-11 07:00:57.542"},{"id":"cmcygx54m000kl20420z7vpnb","userId":"cmcxjbvq1000wjl051dko4d5a","type":"resume","score":78,"duration":10,"completed":true,"improvements":["The resume lacks quantifiable results to demonstrate the impact of the candidate's contributions.","The resume could be strengthened by explicitly mentioning DevOps methodologies like Infrastructure as Code (IaC), Continuous Integration, and Continuous Delivery.","The project section is not relevant to a DevOps Engineer role and should be replaced with more relevant experience or projects."],"createdAt":"2025-07-11 07:01:08.278"},{"id":"cmcyibi0c0006l1047au7qzdz","userId":"cmcyi8qgz0000l104im80fkjw","type":"resume","score":75,"duration":7,"completed":true,"improvements":["The resume lacks quantifiable results and impact metrics for most projects and responsibilities.","The descriptions of projects and responsibilities are often too general and do not highlight specific contributions or achievements.","The resume does not explicitly mention experience with specific machine learning algorithms or frameworks beyond those used in projects."],"createdAt":"2025-07-11 07:40:17.772"},{"id":"cmcyicqsx0008l104vxe78pmn","userId":"cmcyi8qgz0000l104im80fkjw","type":"resume","score":78,"duration":13,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's work on the projects described.","The project descriptions should include more details about the specific models used, the datasets employed, and the evaluation metrics achieved.","The resume lacks information about experience with deploying and maintaining AI/ML models in production environments."],"createdAt":"2025-07-11 07:41:15.826"},{"id":"cmcyketjl000dji043thrwked","userId":"cmb09chtd0000k704g2e54mw9","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume could benefit from stronger quantification of achievements, particularly in terms of impact on business metrics or user experience.","More details on the specific technologies used in each project and their application would strengthen the technical narrative.","The description of projects lacks context regarding the scale or complexity of the applications."],"createdAt":"2025-07-11 08:38:51.921"},{"id":"cmcykftzx000fji0402w69y5r","userId":"cmcyjvds70005ji04vpt9zcvg","type":"resume","score":78,"duration":10,"completed":true,"improvements":["The descriptions of project accomplishments need more quantifiable results to showcase the impact of the candidate's work.","The summary section could be more targeted towards backend development, emphasizing specific skills and career goals related to this field.","The skills section could be expanded to include more specific backend-related technologies and frameworks."],"createdAt":"2025-07-11 08:39:39.166"},{"id":"cmcykh5w1000hji04jktyge9q","userId":"cmcyjvds70005ji04vpt9zcvg","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume needs more quantifiable results related to backend performance, scalability, or efficiency improvements.","The descriptions of projects should explicitly state the candidate's role and contributions within the backend development process.","The summary should be tailored more specifically to backend development, emphasizing relevant skills and experience."],"createdAt":"2025-07-11 08:40:41.233"},{"id":"cmcz0u8rw0006l204buk4bj7t","userId":"cmcxwzd610000js04dpu5gsia","type":"resume","score":88,"duration":8,"completed":true,"improvements":["While the resume mentions AWS, it could benefit from highlighting specific AWS services used and the problems they solved.","The resume could be strengthened by explicitly stating how the candidate's contributions impacted users or customers.","The resume could benefit from a more focused approach, prioritizing the most relevant experiences and skills for a Software Engineer role at Amazon."],"createdAt":"2025-07-11 16:18:45.356"},{"id":"cmcz2muc7000blf0468e6iurt","userId":"cmcz2krbx0005lf04wi0ac9ce","type":"resume","score":78,"duration":12,"completed":true,"improvements":["The resume lacks quantifiable results and specific achievements within each experience.","The descriptions of projects and internships are too generic and do not highlight the impact of the candidate's work.","The resume does not clearly demonstrate a specific area of expertise or passion within software engineering."],"createdAt":"2025-07-11 17:08:59.288"},{"id":"cmcz3yclj0006l804a3o5ovyu","userId":"cmcz3wc5s0000l804aqigukof","type":"resume","score":78,"duration":12,"completed":true,"improvements":["The resume lacks explicit examples of applying AI/ML techniques to financial data or trading strategies, which is a key focus for Jane Street.","The applicant should quantify the impact of their projects with metrics relevant to trading, such as improved accuracy, reduced latency, or increased profitability.","The resume should explicitly mention any experience with time series analysis, forecasting, or other techniques commonly used in quantitative finance."],"createdAt":"2025-07-11 17:45:55.783"},{"id":"cmcz8ue8n0006jo04vbncfh1o","userId":"cmcxwzd610000js04dpu5gsia","type":"resume","score":80,"duration":12,"completed":true,"improvements":["The resume could benefit from quantifying the impact of projects and experiences with specific metrics related to cost savings, performance improvements, or user engagement.","The candidate should explicitly state how their projects align with customer obsession, a core Amazon leadership principle.","The resume could be improved by emphasizing contributions to team-based projects and showcasing collaboration skills."],"createdAt":"2025-07-11 20:02:49.367"},{"id":"cmcz8w3kv0008jo04v37xnv0f","userId":"cmcxwzd610000js04dpu5gsia","type":"resume","score":88,"duration":11,"completed":true,"improvements":["The resume could benefit from more specific examples of solving complex problems or contributing to large-scale projects.","The candidate should provide more context on the impact of their contributions to previous projects.","The resume could be more tailored to the specific team or role being applied for, highlighting the most relevant skills and experiences."],"createdAt":"2025-07-11 20:04:08.864"},{"id":"cmczhtncr0001jx04nkesxbq4","userId":"cmcz8ei3p0000jo04x9prbaic","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume should include more quantifiable achievements to demonstrate the impact of the candidate's work, such as specific improvements in user engagement, conversion rates, or code quality.","While AWS experience is mentioned, the resume could benefit from more details on how these services were used to solve specific problems and improve system performance.","The resume could be tailored more specifically to the Amazon Software Engineer role by highlighting experiences that align with their current projects and technologies."],"createdAt":"2025-07-12 00:14:11.068"},{"id":"cmczmcr1j0006jp046x655doj","userId":"cmczmaek20000jp04qujvsh6p","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume lacks explicit mention of experience related to financial markets, trading, or quantitative finance, which are highly valued at Citadel.","The descriptions of previous roles could be more tailored to highlight skills and experiences relevant to the specific requirements of a Software Engineer at a trading firm.","The resume should explicitly state any experience with SQL or R, as these are preferred skills."],"createdAt":"2025-07-12 02:21:00.775"},{"id":"cmczmilgc0008jp04vo0omg4k","userId":"cmczmaek20000jp04qujvsh6p","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume should quantify the impact of the AI-based wildlife recognition software, such as the percentage reduction in workload or increase in monitoring efficiency.","It needs more explicit mention of experience with frameworks like TensorFlow or PyTorch, as these are preferred qualifications.","The resume should elaborate on the specific algorithms and techniques used in the COVID-19 strain analysis and 911 call triage system projects."],"createdAt":"2025-07-12 02:25:33.469"},{"id":"cmczwyqmb0006l20499auid3o","userId":"cmczwvf5e0000l204a1dkvfoi","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume lacks specific quantifiable achievements in the work experience section.","The impact of the automation scripts and Google Sheets system at BagPatch could be better quantified with metrics.","The project descriptions could benefit from more detail on the specific technical challenges overcome and the individual's contributions."],"createdAt":"2025-07-12 07:18:02.819"},{"id":"cmczwzhi00008l204beqv21eb","userId":"cmczwvf5e0000l204a1dkvfoi","type":"resume","score":78,"duration":10,"completed":true,"improvements":["The resume lacks specific details about the size and scope of projects, making it difficult to assess the candidate's ability to handle large-scale applications.","The descriptions of accomplishments could be more impactful by quantifying results whenever possible, for example, by specifying the performance improvements achieved through optimization.","The \"Experience\" section is limited to a single internship, which may not be sufficient to demonstrate practical experience for some positions."],"createdAt":"2025-07-12 07:18:37.656"},{"id":"cmd0fvsbk0006l804ikioiss4","userId":"cmd0ftm8p0000l804dw11zabd","type":"resume","score":72,"duration":7,"completed":true,"improvements":["The resume lacks quantifiable results in previous roles, particularly regarding scalability, security, or performance improvements.","It needs to explicitly address experience with building secure and governable systems, a key requirement for the ChatGPT for Work product.","The resume should demonstrate experience with tooling and systems that empower other engineers, as mentioned in the job description."],"createdAt":"2025-07-12 16:07:37.761"},{"id":"cmd0o1si60006jt04x14748gt","userId":"cmd0o0tkl0000jt041wf3w37d","type":"resume","score":82,"duration":9,"completed":true,"improvements":["The resume could benefit from more specific examples of backend architectures the candidate has worked with.","While API development is mentioned, detailing the types of APIs (REST, GraphQL) and the technologies used would be beneficial.","The candidate should quantify the impact of their work whenever possible, such as the scale of APIs they've built or the performance improvements they've achieved."],"createdAt":"2025-07-12 19:56:14.862"},{"id":"cmd0owew90008jt04vlpylrcq","userId":"cmd0o0tkl0000jt041wf3w37d","type":"resume","score":82,"duration":6,"completed":true,"improvements":["The profile statement is somewhat generic and could be tailored to emphasize specific backend expertise or career goals.","The resume could benefit from highlighting experience with specific architectural patterns relevant to backend development, such as microservices or event-driven architectures.","While the resume mentions technologies, it lacks detail on how they were used to solve specific backend challenges."],"createdAt":"2025-07-12 20:20:03.561"},{"id":"cmd0vvgkh0001js04vxedk9qa","userId":"cmczmaek20000jp04qujvsh6p","type":"resume","score":65,"duration":8,"completed":true,"improvements":["The resume lacks specific experience managing engineering teams or projects, a crucial requirement for an Engineering Manager role.","The descriptions of projects and experiences should be more focused on quantifiable achievements and impact on the business.","The resume needs to demonstrate experience with financial data, trading systems, or other relevant financial technologies."],"createdAt":"2025-07-12 23:35:16.385"},{"id":"cmd0zptjj0001kw04eugzz7ta","userId":"cmd0ftm8p0000l804dw11zabd","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume needs more specific quantification of the impact of the \"scalable deletion system.\" The candidate should elaborate on the specific database technologies used and the scale achieved.","The resume could benefit from emphasizing experience with security and governance, given the focus on earning customer trust.","More detail on the specific security enhancements implemented in the Tata Consultancy Services role would be beneficial."],"createdAt":"2025-07-13 01:22:51.728"},{"id":"cmd24n2sx0001ky04h8g0kqnb","userId":"cmd0ftm8p0000l804dw11zabd","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume needs more quantifiable metrics to demonstrate the impact of the candidate's work, especially regarding performance and scalability.","The candidate should elaborate on the specific backend technologies used in each project and their proficiency level.","The resume lacks details about the architecture of the systems the candidate has worked on, a crucial aspect for backend roles."],"createdAt":"2025-07-13 20:28:28.017"},{"id":"cmd28uljm0006l204q5yd4lmr","userId":"cmd28thom0000l20456gm7hei","type":"resume","score":60,"duration":12,"completed":true,"improvements":["The resume needs more quantifiable results and demonstrable impact in previous roles.","The descriptions of experiences are often vague and lack specific examples of how the candidate applied their skills to solve problems or achieve measurable outcomes.","The resume should emphasize data-related projects and experiences over general skills and activities."],"createdAt":"2025-07-13 22:26:17.363"},{"id":"cmd2al5s90008jz04du8a389o","userId":"cmd0o0tkl0000jt041wf3w37d","type":"resume","score":80,"duration":14,"completed":true,"improvements":["The resume should emphasize experience with technologies commonly used in streaming or real-time applications, if applicable.","The candidate could benefit from showcasing experience with cloud platforms (AWS or Azure) in the context of backend development and scaling.","The resume lacks specific examples of contributing to architectural discussions or making technological choices."],"createdAt":"2025-07-13 23:14:56.265"},{"id":"cmd2bl05d0001l804dant1wi6","userId":"cmcwqhzgl0005ld04i641jz0g","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume should quantify the impact of initiatives more consistently.","The resume could benefit from a stronger focus on strategic thinking and business impact.","The resume needs to emphasize managerial responsibilities over individual technical contributions."],"createdAt":"2025-07-13 23:42:48.577"},{"id":"cmd2byc800001jj041ftefgv1","userId":"cmcwqhzgl0005ld04i641jz0g","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume needs more emphasis on strategic planning and financial impact beyond cost savings.","The candidate should elaborate on experience defining and executing engineering roadmaps.","The resume could benefit from demonstrating experience with performance reviews, compensation planning, and budget management."],"createdAt":"2025-07-13 23:53:10.753"},{"id":"cmd2ccp290001if04z6v2v8m3","userId":"cmcwqhzgl0005ld04i641jz0g","type":"resume","score":82,"duration":14,"completed":true,"improvements":["The resume could benefit from a more detailed explanation of the scope and impact of the projects managed.","The profile section could be more concise and focused on the specific requirements of an Engineering Manager role.","While the resume quantifies some achievements, more metrics related to team performance, project success rates, and operational efficiency would strengthen the impact."],"createdAt":"2025-07-14 00:04:20.577"},{"id":"cmd2ck52t0001l204mh9msmsn","userId":"cmcwqhzgl0005ld04i641jz0g","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume needs more quantifiable results demonstrating the impact of the candidate's leadership on business outcomes.","The descriptions of projects and responsibilities should be more concise and focused on the results achieved.","The resume could benefit from a clearer articulation of the candidate's strategic thinking and vision for engineering teams."],"createdAt":"2025-07-14 00:10:07.925"},{"id":"cmd2crewo0003l20499hyyzcy","userId":"cmcwqhzgl0005ld04i641jz0g","type":"resume","score":82,"duration":9,"completed":true,"improvements":["The resume should explicitly state the size and scope of projects managed, including budget responsibilities.","The profile section could be more targeted towards the specific requirements of the Engineering Manager role, emphasizing leadership philosophy and team-building skills.","The resume could benefit from a stronger emphasis on strategic planning and roadmap development experience."],"createdAt":"2025-07-14 00:15:47.256"},{"id":"cmd2cu25y0005l204qj0rb80k","userId":"cmcwqhzgl0005ld04i641jz0g","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The profile section could be more impactful by explicitly stating management philosophies and leadership style in relation to the Engineering Manager role.","While technical skills are listed, the resume could benefit from more focus on managerial skills like strategic planning, budget management, and resource allocation.","The resume could be improved by including specific examples of conflict resolution and team-building skills."],"createdAt":"2025-07-14 00:17:50.711"},{"id":"cmd2cw9om0007l2049abh42lq","userId":"cmcwqhzgl0005ld04i641jz0g","type":"resume","score":82,"duration":8,"completed":true,"improvements":["The profile section should be more concise and directly address the requirements of an Engineering Manager role.","The resume could benefit from a stronger emphasis on strategic planning and decision-making within the context of engineering management.","While technical skills are listed, the resume should better highlight how these skills have been applied to solve specific engineering management challenges."],"createdAt":"2025-07-14 00:19:33.767"},{"id":"cmd2cz2ab0009l2049mold5cv","userId":"cmcwqhzgl0005ld04i641jz0g","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume should quantify the impact of initiatives more consistently, moving beyond percentages to include concrete numbers.","The \"Systems Experience and Skills\" section could be more targeted, focusing on the technologies most relevant to the target role's industry.","The resume lacks specific information about the size and complexity of projects managed, which is crucial for an Engineering Manager position."],"createdAt":"2025-07-14 00:21:44.148"},{"id":"cmd2d0b2c000bl204pvfqaihy","userId":"cmcwqhzgl0005ld04i641jz0g","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume needs more specific details about individual technical contributions, such as specific features developed, algorithms designed, or complex problems solved, especially in the most recent roles.","Quantifiable achievements related to code performance, scalability, or reliability are missing, and these should be included.","The candidate should focus on highlighting their technical depth and problem-solving skills rather than just management responsibilities."],"createdAt":"2025-07-14 00:22:42.18"},{"id":"cmd35rn0e0006kv04h3g38gi3","userId":"cmd35bk2k0000kv049xzdrrt8","type":"resume","score":65,"duration":13,"completed":true,"improvements":["The resume lacks quantifiable results and specific accomplishments for each role.","The descriptions of responsibilities are generic and do not demonstrate the impact of the candidate's work.","The resume needs to highlight complex problem-solving skills and leadership qualities expected of a Senior Software Engineer."],"createdAt":"2025-07-14 13:47:46.622"},{"id":"cmd38848r0001l104gz7tvbqe","userId":"cmcx7kjrt0007jv04q5uqzfrs","type":"resume","score":78,"duration":5,"completed":true,"improvements":["The objective statement is generic and should be tailored to the specific internship being applied for.","The project descriptions could benefit from more quantifiable results and impact metrics.","The resume could highlight experience with specific Google technologies or open-source projects relevant to Google's work."],"createdAt":"2025-07-14 14:56:34.683"},{"id":"cmd38a8go0003l104hg66bium","userId":"cmcx7kjrt0007jv04q5uqzfrs","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The objective statement is generic and should be tailored to highlight specific skills and interests relevant to Google.","The resume could benefit from quantifying achievements with more specific metrics and impact statements.","The skills section could be further refined to showcase a deeper understanding of specific technologies and their applications."],"createdAt":"2025-07-14 14:58:13.464"},{"id":"cmd3fkcja0003la04fptwnkbm","userId":"cmbqvxad50000l404qlakb0ql","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume lacks specific examples of working with large datasets or distributed systems, which are important for a Product Engineer at Splunk.","The candidate should provide more context on the scale and complexity of the projects mentioned, especially regarding data volume and user base.","The resume could benefit from including experience with testing frameworks or methodologies beyond just CI/CD."],"createdAt":"2025-07-14 18:22:02.614"},{"id":"cmd53fnuu0006jr04le8liyy0","userId":"cmd53e7il0000jr04nras1nw7","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume lacks quantifiable results for the \"Experience\" section; adding metrics would significantly strengthen the impact.","The descriptions of responsibilities in the \"Experience\" section are somewhat generic and could benefit from more specific details about technical contributions and problem-solving.","The \"Other\" skills section is vague; consider elaborating on specific agile methodologies or providing examples of how these skills were applied."],"createdAt":"2025-07-15 22:18:00.966"},{"id":"cmd55lznt0001ik04zjm29g2f","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The descriptions of experiences and projects lack quantifiable results and specific accomplishments.","The resume would benefit from including metrics to demonstrate the impact of the candidate's work.","The project descriptions should elaborate on the technical challenges faced and the solutions implemented."],"createdAt":"2025-07-15 23:18:55.433"},{"id":"cmd5fb8wf0001jr04yrg360jq","userId":"cmd5fa9ps0000le0443y6k5gr","type":"resume","score":88,"duration":14,"completed":true,"improvements":["While the resume mentions leading cross-functional AI initiatives, providing more specific examples of the challenges overcome and the impact achieved would be beneficial.","Quantifying the impact of security enhancements on MetaAI products would strengthen the resume.","Elaborating on the specific technologies and frameworks used in each project, beyond the general list in the skills section, would provide more context."],"createdAt":"2025-07-16 03:50:30.351"},{"id":"cmd5vhtsd0006l404vmzzqndz","userId":"cmd5vge380000l404mya76a67","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume could benefit from more specific details about the technologies used in each project and their impact.","The descriptions of the projects and experiences lack depth in explaining the challenges faced and the solutions implemented.","The \"Positions of Responsibility\" section is less relevant to a Software Engineer role and should be condensed or replaced with more technical details."],"createdAt":"2025-07-16 11:23:31.213"},{"id":"cmd6b01zy0005jo04io3eb1ay","userId":"cmd53hd3f0007jr04xi85hnx8","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's work on projects and business outcomes.","The descriptions of projects and responsibilities should be more clearly framed in terms of full-stack development tasks and accomplishments.","The resume should provide more concrete examples of designing and developing user interfaces and APIs, as well as managing databases."],"createdAt":"2025-07-16 18:37:35.903"},{"id":"cmd7vxn2g000nla043zpsp1ql","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":82,"duration":9,"completed":true,"improvements":["The descriptions of project accomplishments could be more detailed, explaining the technical challenges and solutions implemented.","The resume could benefit from more specific details about the candidate's contributions to each project, rather than just listing the project's overall purpose.","The \"Awards & Certifications\" section could be more impactful by highlighting the specific skills or knowledge gained from each certification."],"createdAt":"2025-07-17 21:11:21.352"},{"id":"cmd7wmcmd000vla04y2f3htii","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":82,"duration":12,"completed":true,"improvements":["The descriptions of project contributions could be more detailed, explaining the specific technical challenges faced and the solutions implemented.","The resume should quantify the impact of project contributions whenever possible, using metrics to demonstrate the value delivered.","The descriptions of the AI/ML projects could be more specific, detailing the algorithms and techniques used."],"createdAt":"2025-07-17 21:30:34.213"},{"id":"cmd94lvtw0001l404hix00wvx","userId":"cmd3e0jqo0000lc04c7709vh2","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume lacks specific details about the backend architecture and design of the projects and work experiences.","The descriptions of responsibilities in the experience section are too general and should be more specific and quantifiable.","The resume could benefit from showcasing experience with cloud platforms like AWS, which are highly valued at Amazon."],"createdAt":"2025-07-18 18:01:55.556"},{"id":"cmd95zdpl0001l20437gtmuey","userId":"cmcxaoqp0001hjv04hh4kfxhf","type":"resume","score":82,"duration":7,"completed":true,"improvements":["The resume should explicitly highlight experience with backend frameworks like Spring, Django, or Node.js if applicable.","The candidate should showcase experience with API design and development, a core responsibility for backend developers.","The resume should provide more context on the scale and complexity of the backend systems the candidate has worked on."],"createdAt":"2025-07-18 18:40:24.874"},{"id":"cmd960ryd0003l204d756eulo","userId":"cmcxaoqp0001hjv04hh4kfxhf","type":"resume","score":82,"duration":10,"completed":true,"improvements":["The resume could benefit from clarifying the scale and complexity of the projects worked on, particularly in terms of users served or data processed.","Including specific details about the technologies used in each project would strengthen the application.","The candidate should provide more context on the specific business problems solved and the impact on revenue or user engagement."],"createdAt":"2025-07-18 18:41:29.989"},{"id":"cmd9kulnd0001kt04xdgkg13a","userId":"cmcy8306t0000if046mehdoxp","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The \"Code Coach\" experience, while valuable, should be reframed to emphasize transferable skills relevant to software engineering, such as mentorship, code review, or technical communication.","The resume lacks quantifiable results or metrics to demonstrate the impact of the projects, such as number of users, performance improvements, or code quality metrics.","The skills section should be more specific and include versions of technologies used, where appropriate."],"createdAt":"2025-07-19 01:36:36.121"},{"id":"cmd9sccb30001kz04ml87f6bz","userId":"cmd9sb0360000i604hwptl59y","type":"resume","score":72,"duration":6,"completed":true,"improvements":["The resume lacks specific details about the complexity and scale of the projects undertaken.","There is a need for more quantifiable achievements in the Web Designer role that directly relate to frontend development.","The resume could benefit from showcasing experience with modern frontend frameworks like React, Angular, or Vue.js in greater detail beyond a simple listing."],"createdAt":"2025-07-19 05:06:21.135"},{"id":"cmd9wgt9h0006l604qcixbuqr","userId":"cmd9wfxb30000l604vlyxxvz1","type":"resume","score":68,"duration":13,"completed":true,"improvements":["The resume needs more concrete examples of full-stack projects, including details about the technologies used and the problems solved.","The descriptions of previous roles should focus more on software development tasks and less on general IT support duties.","Quantifiable achievements, such as improvements in website performance or user engagement, should be included to demonstrate impact."],"createdAt":"2025-07-19 07:01:48.197"},{"id":"cmdamqfty0006l404xgu4lf86","userId":"cmdamnb5d0000l4042rf85eyf","type":"resume","score":78,"duration":10,"completed":true,"improvements":["The resume lacks detailed descriptions of the technologies used in each work experience bullet point; the technologies should be explicitly mentioned for each accomplishment.","The impact of contributions in previous roles and projects needs to be quantified to demonstrate value and achievements more effectively.","The \"Technical Interests\" section is too general and could be made more specific to showcase targeted interests within software engineering."],"createdAt":"2025-07-19 19:17:07.367"},{"id":"cmdamrfnn0008l4044f7fqy9r","userId":"cmdamnb5d0000l4042rf85eyf","type":"resume","score":78,"duration":13,"completed":true,"improvements":["The descriptions of work experience and projects should be more specific, detailing the challenges faced and the solutions implemented.","The resume lacks quantifiable results in most sections, making it difficult to assess the impact of the candidate's contributions.","The resume could benefit from showcasing a deeper understanding of software engineering principles, such as design patterns or testing methodologies."],"createdAt":"2025-07-19 19:17:53.796"},{"id":"cmdamrr29000al404prx9vcuj","userId":"cmdamnb5d0000l4042rf85eyf","type":"resume","score":75,"duration":11,"completed":true,"improvements":["The resume needs more specific cloud-related experiences and skills to align with the Cloud Engineer role.","It lacks demonstrable experience with major cloud platforms like AWS, Azure, or GCP.","The candidate should quantify achievements more effectively to showcase the impact of their work."],"createdAt":"2025-07-19 19:18:08.577"},{"id":"cmdaqfg240001jo049z43c7zs","userId":"cmdamnb5d0000l4042rf85eyf","type":"resume","score":80,"duration":12,"completed":true,"improvements":["The resume could benefit from stronger quantification of achievements within each role, demonstrating the direct impact of the candidate's contributions.","More details about the specific technologies and methodologies used in each project would strengthen the technical profile.","The \"Technical Skills and Software Proficiencies\" section could be more specific, differentiating between proficiency levels (e.g., \"Expert,\" \"Proficient,\" \"Familiar\")."],"createdAt":"2025-07-19 21:00:32.909"},{"id":"cmdarm4su0001jy04cgd8cobr","userId":"cmdamnb5d0000l4042rf85eyf","type":"resume","score":70,"duration":13,"completed":true,"improvements":["The resume lacks specific experience with infrastructure-as-code tools like Terraform or CloudFormation.","There's no mention of experience with containerization technologies like Docker or Kubernetes.","Monitoring and logging tools, such as Prometheus, Grafana, or ELK stack, are not mentioned."],"createdAt":"2025-07-19 21:33:44.527"},{"id":"cmdarnjji0001jo04iigx54ak","userId":"cmdamnb5d0000l4042rf85eyf","type":"resume","score":70,"duration":9,"completed":true,"improvements":["The resume lacks specific cloud platform experience (e.g., AWS, Azure, GCP).","The descriptions of work experience and projects should quantify achievements with metrics directly related to cloud performance, cost savings, or efficiency improvements.","The \"Technical Skills and Software Proficiencies\" section needs to be expanded to include cloud-specific tools and technologies."],"createdAt":"2025-07-19 21:34:50.287"},{"id":"cmdb59l5b0001kz04eaaj8h58","userId":"cmd8905oe0000jx04ja3mt8hd","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume could benefit from more specific examples of how the candidate's contributions directly impacted project outcomes.","There should be a clear articulation of the problem being solved in each project, the solution implemented, and the resulting impact.","The resume lacks specific details on testing methodologies used and could benefit from mentioning unit testing or integration testing experience."],"createdAt":"2025-07-20 03:55:53.807"},{"id":"cmdbojhpm0001l904aerj3vh0","userId":"cmcyjvds70005ji04vpt9zcvg","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The professional summary is too generic and should be tailored to highlight specific skills and career goals related to Full Stack Development.","The project descriptions should quantify accomplishments and contributions more effectively, focusing on the impact on users or the business.","The Security Analyst experience, while valuable, needs to be contextualized to show transferable skills relevant to software development, such as problem-solving or attention to detail."],"createdAt":"2025-07-20 12:55:28.619"},{"id":"cmdbokxao0003l9047ccfe8b4","userId":"cmcyjvds70005ji04vpt9zcvg","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The professional summary is too generic and should be tailored to explicitly state the desired Backend Developer role at Google and highlight specific skills relevant to Google's tech stack.","The project descriptions lack quantifiable results; the candidate should focus on showcasing the impact of their work with metrics.","The resume needs more emphasis on backend-specific skills and experiences, such as database optimization, scaling, and system design."],"createdAt":"2025-07-20 12:56:35.472"},{"id":"cmdbq7wji0001i204bdsmm9tx","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume needs more concrete examples of the scale and complexity of the systems the candidate has worked on; mentioning the number of users or the volume of data processed would be beneficial.","The candidate should quantify the impact of their work on business metrics, such as revenue, user engagement, or cost savings.","The resume needs to be tailored to the specific role and company being applied to, highlighting the skills and experiences that are most relevant."],"createdAt":"2025-07-20 13:42:27.199"},{"id":"cmdbugpx00006l704zdh9fcwa","userId":"cmdbue60k0000l704z1j40eu6","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume needs more quantifiable results in the professional experience section to demonstrate impact.","The \"Cloud Support Engineer\" role should be framed with a security-centric perspective.","The resume should include more specific examples of security-related tasks and projects undertaken."],"createdAt":"2025-07-20 15:41:16.98"},{"id":"cmdbupf190001lb04yyealqr1","userId":"cmdbue60k0000l704z1j40eu6","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume lacks quantifiable metrics related to security improvements or incident response effectiveness in the professional experience section.","The descriptions of the academic projects could be more detailed, highlighting the specific security technologies or methodologies used.","The resume could benefit from highlighting specific security tools and technologies used in the CTF competitions and the CyberTracker Challenge."],"createdAt":"2025-07-20 15:48:02.781"},{"id":"cmdbvina7000dlb04meix4sf3","userId":"cmdbue60k0000l704z1j40eu6","type":"resume","score":78,"duration":13,"completed":true,"improvements":["The resume needs more quantifiable achievements related to security implementations or improvements.","The Cloud Support Engineer experience should be framed to highlight security-related tasks and accomplishments.","The resume could benefit from including specific security tools and technologies used in the professional and academic experiences."],"createdAt":"2025-07-20 16:10:46.495"},{"id":"cmdbwdh370001js04b14akrfd","userId":"cmdbue60k0000l704z1j40eu6","type":"resume","score":78,"duration":5,"completed":true,"improvements":["The resume lacks specific metrics to quantify the impact of the candidate's contributions in their professional experience.","The skills section could be more detailed and include specific security tools and technologies.","The resume could benefit from including more information about incident response experience."],"createdAt":"2025-07-20 16:34:44.804"},{"id":"cmdc39a3c0001l80412mnn3ev","userId":"cmdbue60k0000l704z1j40eu6","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume needs more quantifiable achievements related to security implementations and improvements.","The current professional experience as a Cloud Support Engineer, while relevant, should be framed to highlight security aspects of the role.","The technical skills section could be more specific, detailing the tools and technologies used in each area."],"createdAt":"2025-07-20 19:47:26.424"},{"id":"cmdcy81sp0006l804s0w31b62","userId":"cmdcy67zm0000l804s2a368mt","type":"resume","score":75,"duration":9,"completed":true,"improvements":["The summary should be more targeted towards the specific requirements of a Full Stack Developer role, emphasizing contributions and impact.","The project descriptions lack quantifiable results, such as improvements in performance, user engagement, or efficiency.","The resume should include more details about the specific challenges overcome and the solutions implemented in each project."],"createdAt":"2025-07-21 10:14:17.114"},{"id":"cmddsjys10009l504rylrue1j","userId":"cmdds5cwj0003l5046d8c9aud","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume lacks explicit mention of experience working with trading systems or financial data, which would be highly relevant to IMC.","The candidate should elaborate on the complexity of the problems solved and the algorithms used in their previous projects.","The description of collaboration with non-engineers could be more specific and highlight problem-solving skills in a dynamic environment."],"createdAt":"2025-07-22 00:23:21.554"},{"id":"cmddtp1070001kt04wwmxj9xz","userId":"cmdds5cwj0003l5046d8c9aud","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The summary should be tailored to reflect an interest in the financial markets and the specific technologies used at IMC, even if previous knowledge is limited.","The resume lacks explicit mention of Java or C++, which are preferred languages according to the job description.","While AWS experience is valuable, the resume should highlight specific skills applicable to building robust and scalable backend systems."],"createdAt":"2025-07-22 00:55:17.335"},{"id":"cmdeqobta0001jt04ffhxwghk","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume lacks quantifiable results and specific achievements in the experience and project sections.","The descriptions of responsibilities are often vague and don't clearly demonstrate the impact of the candidate's work.","The \"Extra-Curricular Activities\" section is less relevant and could be shortened or removed to make space for more technical details."],"createdAt":"2025-07-22 16:18:32.015"},{"id":"cmdeupt1h0001la04o34k8ah7","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume could benefit from more detailed descriptions of the technologies used in each project, providing more context for the technical skills.","The descriptions of the projects should emphasize the engineering challenges overcome and the technical solutions implemented.","The \"Math Tutor\" experience is less relevant to a Software Engineer role and could be minimized or reframed to highlight transferable skills such as communication or problem-solving."],"createdAt":"2025-07-22 18:11:39.461"},{"id":"cmdevhhko0001l804ezqfaguy","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":12,"completed":true,"improvements":["The resume lacks specific details about the AI/ML models or algorithms used in the projects and research experiences.","The descriptions of the projects could be enhanced by quantifying the impact of the AI/ML solutions developed, such as improved accuracy or efficiency gains.","The resume should highlight the candidate's experience with specific AI/ML techniques, such as deep learning, natural language processing, or computer vision, if applicable."],"createdAt":"2025-07-22 18:33:10.968"},{"id":"cmdeviidg0003l8048bzckq1n","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":12,"completed":true,"improvements":["The resume should explicitly mention the data science methodologies used in the projects and research experience.","The candidate should quantify the impact of their contributions in the Technical Support Intern role, focusing on data-related tasks or improvements.","The resume should include specific examples of how data analysis or modeling was used in projects, rather than just listing the technologies."],"createdAt":"2025-07-22 18:33:58.66"},{"id":"cmdevnyex0005l80499mfecpi","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's work.","The descriptions of the projects and experience should include specific metrics and achievements whenever possible.","The resume should explicitly state the types of software engineering roles the candidate is targeting."],"createdAt":"2025-07-22 18:38:12.729"},{"id":"cmdevsrp20007l804eeq0claa","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":10,"completed":true,"improvements":["The resume should include more details about the specific contributions made in the Technical Support Intern role.","The descriptions of the research assistant role could be more focused on technical contributions instead of solely research outcomes.","The resume could benefit from a brief summary or objective statement at the beginning to highlight career goals and key skills."],"createdAt":"2025-07-22 18:41:57.302"},{"id":"cmdevu1a10009l804pupyngzr","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume lacks specific details about the frontend architecture and design patterns used in the projects.","The descriptions of projects could benefit from emphasizing the specific frontend challenges overcome and the innovative solutions implemented.","The resume could benefit from a stronger focus on frontend-specific accomplishments within the research and technical support roles."],"createdAt":"2025-07-22 18:42:56.377"},{"id":"cmdewj0mv0001lf045zdyyru6","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's work.","The descriptions of projects and experiences should emphasize the technical challenges overcome and the specific technologies used in each situation.","The resume lacks details regarding testing methodologies or contributions to team projects."],"createdAt":"2025-07-22 19:02:21.943"},{"id":"cmdf3fdmn0006l20477kha1q7","userId":"cmdf3bg5m0000l204p2zkd6iz","type":"resume","score":78,"duration":5,"completed":true,"improvements":["The resume needs to quantify achievements in previous roles to demonstrate the impact of the candidate's work.","The descriptions of professional experiences should be more detailed and focus on the specific contributions made to each project.","The resume should include more keywords related to Oracle's technology stack and cloud services."],"createdAt":"2025-07-22 22:15:29.472"},{"id":"cmdgr2xhe0001le04e5o0l8gj","userId":"cmdds5cwj0003l5046d8c9aud","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume lacks explicit mention of experience with microservices architecture, a key requirement for the role.","While API design is mentioned in the summary, the experience section could benefit from more detailed examples of designing and implementing RESTful APIs.","The candidate should elaborate on their understanding of SQL database design, as this is also mentioned as a requirement."],"createdAt":"2025-07-24 02:05:25.634"},{"id":"cmdgrgnjp0001l404g1mskz7g","userId":"cmdds5cwj0003l5046d8c9aud","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume lacks explicit mention of experience with blockchain technologies or financial systems, which are crucial for Circle's mission.","The candidate should provide more details on the scale and complexity of the microservices they have developed.","The resume could benefit from showcasing experience with messaging systems like Kafka or RabbitMQ, which are commonly used in distributed architectures."],"createdAt":"2025-07-24 02:16:05.941"},{"id":"cmdgrsoul0001la04u8ujmp2c","userId":"cmdds5cwj0003l5046d8c9aud","type":"resume","score":78,"duration":12,"completed":true,"improvements":["The resume lacks explicit mention of experience with blockchain technologies, which is central to Circle's mission.","The candidate should emphasize experience related to payment systems or financial technologies to better align with the job description.","While AWS experience is present, specifying which services were used in a backend context would be beneficial."],"createdAt":"2025-07-24 02:25:27.501"},{"id":"cmdgs0ogo0003la04otm918fo","userId":"cmdds5cwj0003l5046d8c9aud","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume should include specific examples of designing and building publicly accessible APIs, highlighting experience in making complex payment systems easy to integrate with.","The candidate should quantify the impact of their work on system performance, reliability, or security, providing concrete metrics to demonstrate their contributions.","The resume should emphasize experience with data sources, messaging systems and APIs, especially in the context of payment systems."],"createdAt":"2025-07-24 02:31:40.249"},{"id":"cmdhww7d10001k104cvx4msvw","userId":"cmdhwrgf90000la04vzntvtau","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume lacks specific achievements quantified with metrics to demonstrate the impact of security initiatives.","The \"About Me\" section is generic and needs to be rewritten to highlight security expertise and career goals related to security engineering.","The descriptions of previous roles focus more on general IT tasks rather than specific security-related accomplishments."],"createdAt":"2025-07-24 21:35:55.717"},{"id":"cmdiabmee000cl504fsfm4lhm","userId":"cmdia2abz0006l504sj65yzru","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume lacks specific details about the scale and complexity of the projects worked on.","The descriptions of the internship experiences could be more detailed, highlighting specific contributions and technologies used.","The resume should include more details about backend technologies used in the projects."],"createdAt":"2025-07-25 03:51:50.055"},{"id":"cmdiad9fm000el504fxqf4kuk","userId":"cmdia2abz0006l504sj65yzru","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume lacks specific details about the technologies used in the full-stack solutions refactoring project at GoDaddy.","The candidate should quantify the impact of their work on the backend provisioning system at GoDaddy beyond just code coverage.","The resume could benefit from more details about the architecture and design choices made in the \"Travel Diary Mobile App\" project."],"createdAt":"2025-07-25 03:53:06.562"},{"id":"cmdix88hy0001la04x34575k6","userId":"cmcyi8qgz0000l104im80fkjw","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume lacks quantifiable results in the project descriptions, making it difficult to assess the impact of the candidate's work.","The project descriptions should be more detailed and focus on the specific challenges addressed and the solutions implemented.","The resume could benefit from including specific metrics, such as improved accuracy or reduced latency, to demonstrate the value of the candidate's contributions."],"createdAt":"2025-07-25 14:33:03.238"},{"id":"cmdj7obpy0006kz04w1c3upqc","userId":"cmdj7n9a80000kz043ixce1dz","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume lacks quantifiable results for the projects, making it difficult to assess the impact of the candidate's work.","The descriptions of the projects are somewhat generic and could be improved by highlighting specific challenges overcome and solutions implemented.","The \"Achievements and Activities\" section is not directly related to software engineering skills and could be made more relevant."],"createdAt":"2025-07-25 19:25:30.071"},{"id":"cmdjld9460001l504armoasl5","userId":"cmcr61kof0002l7049cajxw52","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume lacks specific quantifiable achievements, such as improved application performance or reduced development time.","The description of project contributions needs to be more specific, detailing the candidate's role and impact on each project.","The resume could benefit from elaborating on specific features developed or problems solved in each project."],"createdAt":"2025-07-26 01:48:48.102"},{"id":"cmdkpohgk0006js04lko35sb5","userId":"cmdkpihjs0000js04p9pqx1a9","type":"resume","score":80,"duration":5,"completed":true,"improvements":["The resume should explicitly mention experience with serverless computing solutions like AWS Lambda and API Gateway, as the job description emphasizes these technologies.","The candidate should quantify the impact of their contributions in the Software Engineer Intern role to demonstrate tangible results.","The descriptions of the projects could be enhanced by highlighting the scalability and performance aspects of the solutions."],"createdAt":"2025-07-26 20:37:16.772"},{"id":"cmdkpze3l0008js04x6gd7c0a","userId":"cmdkpihjs0000js04p9pqx1a9","type":"resume","score":80,"duration":9,"completed":true,"improvements":["The resume needs stronger quantifiable results to demonstrate the impact of the candidate's contributions.","The descriptions in the project section could be more detailed, explaining the purpose and impact of each project.","The resume should include more specific keywords related to the types of software engineering roles the candidate is targeting."],"createdAt":"2025-07-26 20:45:45.633"},{"id":"cmdlwudjh0006l5042rliu1ck","userId":"cmdlwt8390000l50485kfj9zf","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume lacks specific quantifiable results in the experience and project sections, making it difficult to assess the impact of the candidate's contributions; adding metrics to showcase accomplishments is crucial.","The descriptions of the projects and the research intern role should be more focused on the software engineering aspects, emphasizing the development process, challenges overcome, and the technologies used.","The technologies section could be organized more effectively, perhaps separating languages, frameworks, and tools for clarity."],"createdAt":"2025-07-27 16:45:35.118"},{"id":"cmdlwv6f70008l5043qm46ag1","userId":"cmdlwt8390000l50485kfj9zf","type":"resume","score":78,"duration":9,"completed":true,"improvements":["Quantify the impact of project contributions with specific metrics, such as improved API response time or reduced server costs.","Emphasize backend-specific responsibilities and accomplishments within project descriptions.","Provide more details regarding database design and optimization efforts."],"createdAt":"2025-07-27 16:46:12.547"},{"id":"cmdnktjz80001jl04joy6kko3","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":82,"duration":8,"completed":true,"improvements":["The resume should consistently quantify accomplishments to demonstrate the impact of the candidate's work.","The descriptions of project contributions could be more detailed, elaborating on the technologies and methodologies used.","The \"Other\" skills section could be more specific and categorized for better readability and ATS optimization."],"createdAt":"2025-07-28 20:44:33.764"},{"id":"cmdovm8s00001l704blhkgc0m","userId":"cmdovk6q70000le0477jbbko7","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume could benefit from more specific examples of problem-solving and technical challenges overcome.","Quantifying achievements with metrics, such as performance improvements or cost savings, would strengthen the impact of each experience.","The summary could be more targeted to specific types of Software Engineering roles, like backend, frontend, or full-stack."],"createdAt":"2025-07-29 18:34:34.609"},{"id":"cmdqaepky0001l404ukqpbpke","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":82,"duration":9,"completed":true,"improvements":["The resume could benefit from more specific examples of how the candidate designed and implemented backend solutions, focusing on architectural decisions and trade-offs.","The project descriptions lack detail regarding the backend architecture and technologies used beyond the listed tools.","While the resume mentions collaboration, it would be beneficial to elaborate on contributions to code reviews, technical documentation, or knowledge sharing within the team."],"createdAt":"2025-07-30 18:16:23.554"},{"id":"cmdrgmad40006ky04bj5wtbbp","userId":"cmdrgk76i0000ky04wdogq9dg","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's work.","The experience section could benefit from more detail about the specific technologies used and the problems solved.","The resume could benefit from more specific examples of how the candidate applied their skills to solve real-world problems."],"createdAt":"2025-07-31 13:58:00.953"},{"id":"cmdrz066t0003l104oluekjni","userId":"cmatyauwu0003jv04krpu2qsq","type":"resume","score":68,"duration":11,"completed":true,"improvements":["The resume lacks specific examples of full stack projects, including the technologies used and the problems solved.","The descriptions of previous roles are too generic and do not highlight technical accomplishments.","The \"Key Competencies\" section should be more detailed and include specific frameworks and libraries."],"createdAt":"2025-07-31 22:32:41.814"},{"id":"cmduj368k0001jy0462rj19oy","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":82,"duration":12,"completed":true,"improvements":["The resume could benefit from more specific examples of architectural decisions made and complex problems solved.","The candidate should elaborate on the specific contributions made in team collaborations, quantifying their impact where possible.","While the resume lists several technologies, it would be beneficial to provide more context on how they were used in specific projects."],"createdAt":"2025-08-02 17:30:26.516"},{"id":"cmduk5xgy0001jv04v4illv3r","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":82,"duration":12,"completed":true,"improvements":["The resume could benefit from further quantifying the impact of the \"Enabled enterprise authentication system\" by specifying the number of users or transactions affected.","Providing more context on the complexity and scale of the microservices architecture involving Kafka would strengthen the application.","It is important to elaborate on the specific contributions made to the AI Career Agent and Real-Time Chat App projects, focusing on the technologies used and challenges overcome."],"createdAt":"2025-08-02 18:00:34.739"},{"id":"cmduk7bbw0003jv04ou0fcilu","userId":"cmcxb5bfn001sjv04bvb2jtia","type":"resume","score":82,"duration":10,"completed":true,"improvements":["Quantify the impact of the frontend development projects to showcase their business value.","Provide more context for the personal projects, highlighting the challenges overcome and the technologies utilized.","Clearly state the specific role the candidate played in collaborative projects."],"createdAt":"2025-08-02 18:01:39.356"},{"id":"cmdwgxwnd0006lb04q3wsgjxm","userId":"cmdwgwhgu0000lb04xe02tad8","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume lacks specific details on the size and complexity of the projects undertaken, which is crucial for assessing the candidate's ability to handle real-world full-stack development challenges.","The descriptions of projects and experiences could benefit from more quantifiable results, such as specific performance improvements or user engagement metrics.","The resume should include more details on the back-end technologies used in the projects, such as the specific type of database (e.g., PostgreSQL, MySQL) or server-side framework (e.g., Django, Spring)."],"createdAt":"2025-08-04 02:05:53.929"},{"id":"cmdxhyoj70001l704tk49rfw3","userId":"cmdds5cwj0003l5046d8c9aud","type":"resume","score":78,"duration":12,"completed":true,"improvements":["The resume lacks specific details regarding experience with SQL, Node.js, or Go, which are also listed as desirable languages.","The candidate should elaborate on experience with open-source RDBMS or NoSQL databases, as the job description mentions them specifically.","The resume could benefit from more quantifiable results, such as the scale of data processed or the impact of implemented features."],"createdAt":"2025-08-04 19:22:15.86"},{"id":"cmdxq3zqm0001jx04a8kwys57","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":75,"duration":14,"completed":true,"improvements":["The resume lacks specific details on the technologies used in each project, making it difficult to assess the depth of the candidate's knowledge.","The descriptions of the projects and experiences should be more focused on the technical challenges overcome and the impact of the solutions.","The resume could benefit from including specific metrics related to performance improvements, scalability, or user engagement."],"createdAt":"2025-08-04 23:10:20.591"},{"id":"cmdxqg86i0001l604fj33isej","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume lacks depth in explaining the technical challenges overcome and the specific technologies utilized within each project.","The descriptions of the projects need to be more detailed and focused on the technical aspects relevant to software engineering.","The resume should provide greater context for the projects, including the size of the codebase, the development methodologies used (e.g., Agile, Scrum), and the candidate's specific role within the project."],"createdAt":"2025-08-04 23:19:51.402"},{"id":"cmdxrv2iu0001kz044uieie05","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The descriptions of the research assistant and technical support intern roles could be more focused on specific software engineering tasks and accomplishments.","The impact of the contributions in these roles needs to be better quantified.","The resume lacks specific examples of coding challenges overcome or complex problems solved, which are essential for demonstrating problem-solving abilities."],"createdAt":"2025-08-04 23:59:23.526"},{"id":"cmdyqsmc50001jy04dgg71fm5","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":12,"completed":true,"improvements":["The descriptions for project and experience sections could be more specific about the technical challenges overcome and the solutions implemented.","The resume should quantify achievements whenever possible, such as the scale of applications built or the impact of code optimizations.","The descriptions lack details about the software development lifecycle (SDLC) methodologies used, such as Agile or Scrum."],"createdAt":"2025-08-05 16:17:15.797"},{"id":"cmdyr1nvc0001jx04823c3sor","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume could benefit from more specific examples of problem-solving and coding challenges overcome in each role.","The descriptions of projects and experiences could be enhanced by detailing the specific technologies used and the architectural decisions made.","While the skills section lists several technologies, it lacks context on the depth of knowledge and practical application of each skill."],"createdAt":"2025-08-05 16:24:17.688"},{"id":"cmdyr6epn0001kz04z8a3nha4","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The descriptions of the projects and experiences could be more detailed, specifying the candidate's individual contributions and the technical challenges overcome.","The resume should include more information about the specific technologies used in each project and the problem-solving approaches taken.","While the resume lists technical skills, it could benefit from highlighting specific areas of expertise or specialization."],"createdAt":"2025-08-05 16:27:59.1"},{"id":"cmdzfwqrv0006l404hfd92soz","userId":"cmdzfvq370000l404qdbg9r1p","type":"resume","score":82,"duration":12,"completed":true,"improvements":["The resume could benefit from more quantifiable metrics to demonstrate the impact of projects and experiences.","While the SLB internship mentions cost reduction and time savings, other sections lack specific numbers to highlight achievements.","The descriptions of projects could be more detailed, explaining the challenges faced and the solutions implemented."],"createdAt":"2025-08-06 04:00:18.571"},{"id":"cmdzfy1690008l4049sszfxyo","userId":"cmdzfvq370000l404qdbg9r1p","type":"resume","score":82,"duration":13,"completed":true,"improvements":["The descriptions of projects and work experiences should include more quantifiable metrics to demonstrate impact.","The resume could benefit from a more detailed explanation of the candidate's contributions to specific projects and how they solved technical challenges.","The \"Leadership & Community Involvement\" section could be more concise, focusing on aspects directly related to software engineering or technical leadership."],"createdAt":"2025-08-06 04:01:18.705"},{"id":"cme0ao8f40006ju04h4s1zxkj","userId":"cme0am5fx0000ju04nctvk5r0","type":"resume","score":78,"duration":12,"completed":true,"improvements":["The resume needs more quantifiable results and impact metrics, especially in the \"Experience\" and \"Personal/Team Projects\" sections.","The candidate should provide more context around the scale and complexity of the projects undertaken.","The resume lacks specific experience with Android or iOS native development, which may be valuable for certain mobile developer roles at Meta."],"createdAt":"2025-08-06 18:21:29.632"},{"id":"cme15mlb20001l504jcnpdqzl","userId":"cme0am5fx0000ju04nctvk5r0","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume lacks specific achievements related to user engagement, app performance optimization, or A/B testing on mobile platforms.","The \"Data Collection & Process Optimization Intern\" experience is not directly related to mobile development and should be minimized or reframed to highlight transferable skills.","The skills section lists a wide range of technologies, but it is not clear which ones the candidate is most proficient in for mobile development."],"createdAt":"2025-08-07 08:48:01.118"},{"id":"cme2gxxp80001kv04k01shm2h","userId":"cme2g47s30000jr04ejacslyh","type":"resume","score":82,"duration":12,"completed":true,"improvements":["The resume should quantify the impact of \"Optimised user experience,\" providing specific metrics related to performance improvements or cost savings.","More details should be provided about the specific database technologies used in the Hashed Tokens role.","The descriptions of the HPE project intern role are vague and lack quantifiable results."],"createdAt":"2025-08-08 06:52:32.349"},{"id":"cme6mteg10001l2047cyl8yb3","userId":"cmcxkrgc10023jl05st6emitq","type":"resume","score":68,"duration":13,"completed":true,"improvements":["The resume lacks quantifiable results or impact metrics for the projects and experiences listed.","The descriptions of work experience are too generic and do not highlight technical accomplishments.","The resume should include more details about the technologies used and the specific contributions made in each project."],"createdAt":"2025-08-11 04:48:03.169"},{"id":"cme6mux1h0003l20405s375uo","userId":"cmcxkrgc10023jl05st6emitq","type":"resume","score":72,"duration":8,"completed":true,"improvements":["The resume should quantify the impact of the Computer Science Tutor role, such as the number of students tutored or improvements in their grades.","The YiFang and 10Pearls experiences are not directly relevant to software engineering and could be shortened or omitted to focus on technical experiences.","The project descriptions lack specific details on the technical challenges overcome and the results achieved."],"createdAt":"2025-08-11 04:49:13.925"},{"id":"cme98vr370001js04p7aj8cok","userId":"cmcxkrgc10023jl05st6emitq","type":"resume","score":72,"duration":8,"completed":true,"improvements":["The descriptions of experiences, especially in non-technical roles, should be more focused on transferable skills relevant to software engineering.","Quantifying the impact of projects and contributions would significantly strengthen the resume.","The resume would benefit from including specific accomplishments and results achieved during projects, rather than just describing the project."],"createdAt":"2025-08-13 00:41:16.771"},{"id":"cme98w1kl0003js04t9latzgi","userId":"cmcxkrgc10023jl05st6emitq","type":"resume","score":70,"duration":8,"completed":true,"improvements":["The resume lacks quantifiable results to demonstrate the impact of the candidate's work.","The descriptions in the experience section could be more specific and achievement-oriented.","The resume could benefit from highlighting specific contributions to team projects."],"createdAt":"2025-08-13 00:41:30.357"},{"id":"cmeao0wc00001i304w3dw23uk","userId":"cmdrgk76i0000ky04wdogq9dg","type":"resume","score":78,"duration":5,"completed":true,"improvements":["The resume lacks depth in describing the impact of the Cloud DevOps internship, focusing more on tasks than accomplishments.","The descriptions of the projects could benefit from stronger quantifiable metrics to demonstrate the value delivered.","The resume would be stronger with more detailed explanations of the technical challenges overcome and the solutions implemented in each project."],"createdAt":"2025-08-14 00:32:57.264"},{"id":"cmeao3xxu0003i304ln80ixn9","userId":"cmdrgk76i0000ky04wdogq9dg","type":"resume","score":82,"duration":14,"completed":true,"improvements":["The resume could benefit from quantifying the impact of contributions in the Cloud DevOps Intern role with specific metrics.","The descriptions of the projects could be more focused on the engineering challenges solved and the technologies employed rather than solely on the project's purpose.","The resume could benefit from including more details about testing methodologies or software development lifecycle experience."],"createdAt":"2025-08-14 00:35:19.314"},{"id":"cmeat1jr10001i804ac50zbbo","userId":"cmd53e7il0000jr04nras1nw7","type":"resume","score":72,"duration":14,"completed":true,"improvements":["The resume lacks quantifiable results for both internship and project experiences.","The descriptions are too generic; they need to showcase the impact of the candidate's contributions.","The resume could benefit from including specific accomplishments and metrics to demonstrate the candidate's skills and impact."],"createdAt":"2025-08-14 02:53:25.693"},{"id":"cmebfn7er0001jp042slehqed","userId":"cmdrgk76i0000ky04wdogq9dg","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume lacks specific details about the size and scope of the projects undertaken, making it difficult to assess the candidate's ability to handle complex tasks.","More quantifiable results should be included to demonstrate the impact of the candidate's work, such as performance improvements or cost savings.","The resume needs to explicitly state the software development methodologies used (e.g., Agile, Scrum) if applicable."],"createdAt":"2025-08-14 13:26:07.683"},{"id":"cmebfztca0003jp04mhm812gz","userId":"cmdrgk76i0000ky04wdogq9dg","type":"resume","score":82,"duration":8,"completed":true,"improvements":["The resume could benefit from more specific examples of how the candidate's contributions impacted the business or project goals.","The descriptions of the projects could be more focused on the technical challenges faced and the solutions implemented.","The candidate should tailor the resume to specific job descriptions by highlighting the most relevant skills and experiences."],"createdAt":"2025-08-14 13:35:55.978"},{"id":"cmeh74qb50001jp04a53z7h6o","userId":"cmdrgk76i0000ky04wdogq9dg","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume lacks specific details regarding the size and complexity of projects, hindering a full assessment of the candidate's capabilities.","The descriptions of the projects could be more detailed, explaining the purpose and impact of the work, not just the technologies used.","While the resume lists several skills, it doesn't explicitly state the candidate's proficiency level in each."],"createdAt":"2025-08-18 14:14:25.841"},{"id":"cmeh7w1wa0001jv04sulshib0","userId":"cmdrgk76i0000ky04wdogq9dg","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume lacks quantifiable results in several areas, particularly in the project descriptions; adding metrics would greatly strengthen the impact.","The descriptions of the projects and internships could be more detailed, elaborating on the specific technical challenges overcome and the solutions implemented.","The resume could benefit from a more targeted skills section, focusing on the specific technologies and frameworks relevant to the targeted Software Engineer roles."],"createdAt":"2025-08-18 14:35:40.571"},{"id":"cmehbtdcw0003l40490bjpng1","userId":"cmaty2tq60000jv04nu33g5ks","type":"resume","score":35,"duration":8,"completed":true,"improvements":["The resume needs a complete overhaul to target the Data Engineer position.","It must highlight relevant technical skills, projects, and experiences.","The candidate should focus on acquiring and showcasing skills in areas like data warehousing, ETL processes, database management, and programming languages used in data engineering."],"createdAt":"2025-08-18 16:25:33.92"},{"id":"cmem7kt050006l404vwvwpsgw","userId":"cmem7hkr20000l40477rpzxyf","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume needs more quantifiable results related to frontend development projects, such as improvements in website performance, user engagement, or conversion rates.","The descriptions of projects and experiences should focus more on the technical challenges and solutions implemented using frontend technologies.","The resume could benefit from a stronger emphasis on specific frontend frameworks and libraries used, along with details on how they were utilized."],"createdAt":"2025-08-22 02:25:46.709"},{"id":"cmesk11ii0001jv04cs4fmdq7","userId":"cmcxjowlh001mjl05o73hz1m1","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume lacks quantifiable achievements and specific project details that demonstrate the impact of the candidate's work.","The descriptions of previous roles are somewhat generic and do not showcase the candidate's unique contributions.","The resume could benefit from including specific examples of problems solved, features developed, or improvements made."],"createdAt":"2025-08-26 13:00:56.682"},{"id":"cmet0xdeu0001jx04b6c0l1rv","userId":"cmet08e0b0000ie04kwjmxrnf","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's work.","The descriptions of the Technical Operator role should be more focused on transferable technical skills.","The resume should clearly state the specific responsibilities and contributions within each project and role."],"createdAt":"2025-08-26 20:53:58.95"},{"id":"cmf2tq5l20006l2044m069vf6","userId":"cmf2tpbj40000l204wcqgnft2","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's work, especially in the research and internship experiences.","Descriptions of projects and experiences should be more detailed, explaining the problem solved, the technologies used, and the measurable outcomes achieved.","The skills section could be organized into more specific categories (e.g., Frontend, Backend, Databases, DevOps) for better clarity."],"createdAt":"2025-09-02 17:30:06.662"},{"id":"cmffx4ule0006js040dpmscxl","userId":"cmffx3u1n0000js04ryl8cctu","type":"resume","score":78,"duration":5,"completed":true,"improvements":["The resume lacks specific quantifiable results in some areas, such as the impact of the Seneau IT architecture transformation.","The descriptions of projects and activities could be more technically detailed, showcasing deeper understanding of the technologies used.","The resume could benefit from a more focused presentation of skills, prioritizing those most relevant to target software engineering roles."],"createdAt":"2025-09-11 21:26:31.394"},{"id":"cmflhj9dp0001l5043s477egd","userId":"cmd53e7il0000jr04nras1nw7","type":"resume","score":78,"duration":12,"completed":true,"improvements":["The resume lacks quantifiable results, making it difficult to assess the impact of the candidate's contributions in previous roles.","The descriptions of projects and internships could be more specific, detailing the technical challenges overcome and the technologies used.","The skills section could be more organized and categorized to highlight specific areas of expertise, such as front-end, back-end, or data science."],"createdAt":"2025-09-15 18:56:26.941"},{"id":"cmflhlarl0003l504q4idf0ai","userId":"cmd53e7il0000jr04nras1nw7","type":"resume","score":82,"duration":12,"completed":true,"improvements":["The resume could benefit from quantifying achievements and contributions in previous roles and projects to demonstrate impact.","The description of responsibilities in the Resident Assistant role could be shortened or refocused to emphasize transferable skills relevant to a technical internship, such as problem-solving or communication.","The skills section could be further refined by specifying proficiency levels or years of experience with each technology."],"createdAt":"2025-09-15 18:58:02.05"},{"id":"cmg4kvotx0006jy0416bzt4tr","userId":"cmg4ku5zq0000jy04h5mkr4s0","type":"resume","score":82,"duration":14,"completed":true,"improvements":["The resume could benefit from more detailed descriptions of the candidate's contributions to specific projects, especially regarding architectural decisions and technical challenges overcome.","The descriptions of responsibilities should be rephrased to emphasize accomplishments and quantifiable results rather than just listing tasks.","The technical skills section could be more specific, indicating proficiency levels or years of experience with each technology."],"createdAt":"2025-09-29 03:37:43.029"},{"id":"cmg4kzu7a0008jy04up6o3qv9","userId":"cmg4ku5zq0000jy04h5mkr4s0","type":"resume","score":82,"duration":11,"completed":true,"improvements":["While the resume lists several technologies, it lacks specific examples of how these technologies were used to solve complex problems.","The descriptions of projects and experiences could be more detailed, providing more context about the challenges faced and the solutions implemented.","The resume could benefit from a clearer articulation of the candidate's problem-solving approach and software development methodologies."],"createdAt":"2025-09-29 03:40:56.615"},{"id":"cmg5jau6g0001l204ghn4lja1","userId":"cmg4ku5zq0000jy04h5mkr4s0","type":"resume","score":82,"duration":7,"completed":true,"improvements":["The resume could benefit from including more specific details about the software development lifecycle methodologies used (e.g., Agile, Scrum, Waterfall).","It would be helpful to explicitly state the size and complexity of the projects undertaken, including the number of users or the scale of data processed.","The candidate should emphasize the impact of their work by quantifying the benefits achieved for the organization or its customers."],"createdAt":"2025-09-29 19:41:16.745"},{"id":"cmg5jfdvq0003l204broi2ibr","userId":"cmg4ku5zq0000jy04h5mkr4s0","type":"resume","score":82,"duration":12,"completed":true,"improvements":["The resume could benefit from more specific details on the technologies used in each project and their purpose.","The candidate should quantify achievements with specific numbers to demonstrate the impact of their work more effectively.","The resume could be improved by tailoring the descriptions of each role and project to highlight the skills and experiences most relevant to the target Software Engineer position."],"createdAt":"2025-09-29 19:44:48.903"},{"id":"cmg5m4b7k0001la041x9n9fd6","userId":"cmg4ku5zq0000jy04h5mkr4s0","type":"resume","score":82,"duration":11,"completed":true,"improvements":["The resume could benefit from more specific examples of contributions to large-scale projects.","Quantifying the impact of projects with concrete metrics would significantly strengthen the resume.","The candidate could elaborate on the specific software development methodologies used in their projects, such as Agile or Scrum."],"createdAt":"2025-09-29 21:00:11.072"},{"id":"cmge2lg3z0001jx04wbfvjtwf","userId":"cmgdzn87g0000l704kpvy0oo7","type":"resume","score":82,"duration":9,"completed":true,"improvements":["The resume could benefit from more details on the scale and complexity of the backend systems developed.","The descriptions of projects would be enhanced by including information on the size of the user base or the volume of data processed.","The candidate should elaborate on the specific architectural patterns used in the backend systems."],"createdAt":"2025-10-05 19:03:33.839"},{"id":"cmge3ueei0003jx04hsn60e2o","userId":"cmgdzn87g0000l704kpvy0oo7","type":"resume","score":82,"duration":6,"completed":true,"improvements":["The resume could benefit from quantifying the impact of projects more concretely, such as the number of users affected or the cost savings achieved.","The descriptions of projects could be more concise and focused on the technical challenges and solutions implemented.","While the resume mentions relevant coursework, it could be beneficial to highlight specific projects or assignments completed in those courses that demonstrate practical skills."],"createdAt":"2025-10-05 19:38:31.147"},{"id":"cmge42or20005jx04pqzedulx","userId":"cmgdzn87g0000l704kpvy0oo7","type":"resume","score":80,"duration":11,"completed":true,"improvements":["The resume could benefit from explicitly stating the size and scope of projects, especially concerning user base, data volume, or system complexity.","While the resume mentions relevant coursework, it could elaborate on specific projects or skills gained from those courses that are applicable to the Software Engineer role.","The resume lacks explicit mention of testing methodologies used, such as unit testing, integration testing, or end-to-end testing, which are crucial for software engineering roles."],"createdAt":"2025-10-05 19:44:57.806"},{"id":"cmge4ga0x0001le04p1o410zs","userId":"cmgdzn87g0000l704kpvy0oo7","type":"resume","score":82,"duration":10,"completed":true,"improvements":["While MoodTune is relevant, the description could be more specific about the music-related aspects of the platform, such as music generation, analysis, or recommendation algorithms.","The resume could benefit from explicitly stating an interest in music technology, as mentioned in the job description.","While the candidate lists relevant coursework, explicitly mentioning courses related to audio processing or music information retrieval would further strengthen the application."],"createdAt":"2025-10-05 19:55:31.905"},{"id":"cmge4i9iy0003le04www31s53","userId":"cmgdzn87g0000l704kpvy0oo7","type":"resume","score":82,"duration":8,"completed":true,"improvements":["The resume lacks explicit mention of experience with audio processing, music information retrieval, or other music-specific technologies.","While the candidate mentions MoodTune, the resume does not explicitly state a passion for music or curiosity about music technology, as requested in the job description.","The resume should emphasize the candidate's understanding of the music domain to better align with Suno's mission."],"createdAt":"2025-10-05 19:57:04.57"},{"id":"cmgea8ksn0001jm04g1y428kz","userId":"cmgdzn87g0000l704kpvy0oo7","type":"resume","score":82,"duration":12,"completed":true,"improvements":["The resume lacks specific details on the size and scale of the projects worked on (e.g., team size, user base, code complexity).","The resume could benefit from more detailed explanations of the architectural decisions made during project development.","The resume could provide more context around the specific challenges faced and how they were overcome."],"createdAt":"2025-10-05 22:37:30.311"},{"id":"cmgej9x810006jj04kwzhgslq","userId":"cmgej1wth0000jj04386hkxsh","type":"resume","score":75,"duration":6,"completed":true,"improvements":["The resume lacks quantifiable results and impact statements within the experience sections.","The description of the Task Management System project could be improved by highlighting the data science aspects, such as data storage and analysis techniques.","The resume needs more emphasis on specific data science projects and their outcomes."],"createdAt":"2025-10-06 02:50:29.617"},{"id":"cmgeoo1300001l7040fc0krce","userId":"cmgdzn87g0000l704kpvy0oo7","type":"resume","score":82,"duration":12,"completed":true,"improvements":["The resume could benefit from more detailed descriptions of the specific problems solved and the impact of the solutions implemented.","While the resume mentions using various technologies, it could provide more context on the scale and complexity of the projects.","More emphasis should be placed on the candidate's contributions to team projects and the specific role they played within those teams."],"createdAt":"2025-10-06 05:21:25.884"},{"id":"cmgswm95h0006lb04ofdwij5o","userId":"cmgswlagz0000lb04l8bt60a6","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume needs more quantifiable results to demonstrate the impact of the candidate's contributions in previous roles.","The descriptions of internship responsibilities could be more specific and action-oriented.","The candidate should tailor the resume content more closely to the specific requirements of the target Software Engineer positions."],"createdAt":"2025-10-16 04:12:46.421"},{"id":"cmgswpkza0008lb04o50vql8m","userId":"cmgswlagz0000lb04l8bt60a6","type":"resume","score":68,"duration":6,"completed":true,"improvements":["The resume lacks specific security certifications such as CISSP, Security+, CEH, or cloud-specific security certifications.","The descriptions of the projects and experiences need to be more focused on security-related outcomes and quantifiable results.","The resume needs to include more details about the specific security tools and technologies used in each role."],"createdAt":"2025-10-16 04:15:21.719"},{"id":"cmgv2oerf0001jp04tpvf56ae","userId":"cmgswlagz0000lb04l8bt60a6","type":"resume","score":78,"duration":10,"completed":true,"improvements":["Quantify the impact of contributions in each role with specific metrics to demonstrate tangible results.","Provide more context for each project and internship, elaborating on the problem solved, the technologies used, and the outcome achieved.","Tailor the resume to specific Software Engineer roles by highlighting the most relevant skills and experiences for each application."],"createdAt":"2025-10-17 16:37:57.051"},{"id":"cmh3tx4di0006l5042gr8la11","userId":"cmh3tvlgi0000l504vamwbrbn","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume lacks specific examples of working with financial datasets or applying mathematical concepts to financial problems.","The professional summary could be more targeted towards the financial industry and the specific requirements of G-Research.","While projects are mentioned, the impact of the work is not always clearly quantified in a financial context."],"createdAt":"2025-10-23 19:42:42.535"},{"id":"cmh85vhgg0006l404aqdhsqh0","userId":"cmh85tzeh0000l404yuxk86gv","type":"resume","score":78,"duration":5,"completed":true,"improvements":["The resume's opening statement is generic and should be replaced with a concise summary highlighting key skills and career goals relevant to Groww.","Quantifiable results should be emphasized more throughout the experience section, focusing on the impact of projects and contributions.","The \"Personal Projects\" section lacks context regarding the technical challenges and solutions implemented, which could be strengthened."],"createdAt":"2025-10-26 20:28:26.273"},{"id":"cmh9gwx0d0003jy04uyked1zc","userId":"cmbv3hdd40000k004n3jsq91q","type":"resume","score":78,"duration":13,"completed":true,"improvements":["The resume lacks specific examples of how data analysis impacted student outcomes or learning gains, which is a key focus for Noon Academy.","The candidate should quantify achievements whenever possible, providing specific metrics to demonstrate the impact of their work.","The resume could benefit from a stronger connection to the education industry and Noon Academy's mission of transforming education."],"createdAt":"2025-10-27 18:25:15.037"},{"id":"cmh9humqw0001jl045cp3426j","userId":"cmbv3hdd40000k004n3jsq91q","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume lacks specific examples of analyzing educational data or contributing to learning outcomes, which is a key aspect of the Data Analyst role at Noon Academy.","The candidate should quantify the impact of their analyses whenever possible, such as by stating how insights led to specific improvements.","The resume could benefit from a stronger emphasis on communication skills, demonstrating the ability to explain data insights to non-technical audiences."],"createdAt":"2025-10-27 18:51:28.04"},{"id":"cmhbxrtdb0001k1046udm09y6","userId":"cmcxjowlh001mjl05o73hz1m1","type":"resume","score":82,"duration":14,"completed":true,"improvements":["The resume could benefit from more specific details about the scale and impact of the projects worked on.","Quantifying achievements with metrics (e.g., number of users impacted, cost savings, performance improvements) would strengthen the resume.","More explicit mention of experience with technologies commonly used at Meta, such as specific databases or cloud services, would be advantageous."],"createdAt":"2025-10-29 11:52:42.863"},{"id":"cmhbybfsc0001ld0479dk5o55","userId":"cmcxjowlh001mjl05o73hz1m1","type":"resume","score":78,"duration":12,"completed":true,"improvements":["The resume lacks quantifiable results, such as specific performance improvements or impact on user engagement.","More details about the specific database frameworks used with AngularJS are needed to showcase back-end proficiency.","The resume needs more specific examples of contributions to the microservices architecture and the technologies used."],"createdAt":"2025-10-29 12:07:58.38"},{"id":"cmhe7zumr0006la04bxkc5dmk","userId":"cmhe7qzci0000la04y8w081si","type":"resume","score":82,"duration":10,"completed":true,"improvements":["The descriptions of the engineering experiences could be more specific in detailing the firmware aspects of the projects.","The summary of qualifications could be more targeted towards firmware development, highlighting specific tools, methodologies, or architectures.","Quantifying the impact of contributions in previous roles would strengthen the resume's impact."],"createdAt":"2025-10-31 02:14:26.26"},{"id":"cmhjrpq2f0006l704qfs26ij2","userId":"cmhjro9550000l704hybvuu56","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume lacks specific examples of how data analysis was used to improve investment decisions or generate alpha.","The descriptions of projects and experiences should be more focused on the data science aspects and less on general business activities.","The resume should include quantifiable results related to data analysis projects, such as increased prediction accuracy or improved portfolio performance."],"createdAt":"2025-11-03 23:25:16.984"},{"id":"cmhlgfkkh0006l504cr8axywv","userId":"cmhlgdq8v0000l504psx96oyr","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume lacks explicit examples of applying machine learning or statistical modeling to financial problems, such as credit risk assessment, fraud detection, or spend management.","The descriptions of projects and research experiences could be improved by quantifying the impact and results achieved.","While the candidate lists several technical skills, the level of proficiency for each skill is not clearly defined."],"createdAt":"2025-11-05 03:44:59.873"},{"id":"cmho0et8t0006js047k5pqfpu","userId":"cmho0cgs60000js04srzbs7ig","type":"resume","score":70,"duration":12,"completed":true,"improvements":["The resume lacks specific examples of low-level microcontroller code development, a key requirement for embedded systems roles.","There is a need to demonstrate experience with debugging firmware, writing drivers, and implementing communication protocols.","The projects described lack details on the complexity of the embedded systems involved and the challenges overcome."],"createdAt":"2025-11-06 22:39:49.133"},{"id":"cmhu2x03g0006jv04wcoyidxc","userId":"cmhu2viyi0000jv04iwkle9nf","type":"resume","score":82,"duration":12,"completed":true,"improvements":["The resume could benefit from more specific details about the size and scope of the projects, particularly regarding user base or data volume.","While the resume mentions Agile/Scrum, elaborating on specific contributions within an Agile team would strengthen this aspect.","Quantifying the impact of projects in terms of cost savings, revenue generation, or user engagement would enhance the resume's impact."],"createdAt":"2025-11-11 04:36:34.109"},{"id":"cmhxm7m6u0006ji045excxdlu","userId":"cmhxm621s0000ji040j1vjka8","type":"resume","score":78,"duration":13,"completed":true,"improvements":["The resume should quantify achievements with metrics to showcase the impact of the candidate's work.","The resume should provide more context on the size and scale of the projects and systems the candidate has worked on.","The resume could benefit from a stronger emphasis on problem-solving skills and how the candidate has overcome technical challenges."],"createdAt":"2025-11-13 16:00:00.534"},{"id":"cmhxm9n6h0008ji04kmou0y85","userId":"cmhxm621s0000ji040j1vjka8","type":"resume","score":78,"duration":11,"completed":true,"improvements":["The resume lacks quantifiable results for each role, making it difficult to assess the candidate's impact.","The descriptions of projects and responsibilities are somewhat generic and need more specific details.","The \"About Me\" section is too generic and does not highlight specific areas of expertise or career goals."],"createdAt":"2025-11-13 16:01:35.129"},{"id":"cmi7kaigw0001jp04sflvzban","userId":"cmhxm621s0000ji040j1vjka8","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume lacks specific details about the scale of systems the candidate has worked on, such as requests per second or data volume.","The descriptions of projects could be more detailed, elaborating on the technical challenges and solutions implemented.","The resume could benefit from including more information about specific Google Cloud Platform (GCP) services used, beyond just mentioning GCP generally."],"createdAt":"2025-11-20 15:03:58.208"},{"id":"cmio04zhs0003jv048ksyta8y","userId":"cmbv5xjzd0000jv04vinlaus2","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume lacks explicit mention of actuarial science knowledge or experience with insurance products, which are preferred qualifications.","The candidate should provide more context on how their technical skills were applied to solve business problems, especially in the financial domain.","The descriptions of projects should be tailored to highlight aspects relevant to risk modeling, such as prediction accuracy and model validation."],"createdAt":"2025-12-02 03:11:53.009"},{"id":"cmiv301f60001l204p2jni6ht","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":82,"duration":11,"completed":true,"improvements":["The resume should quantify more achievements with specific numbers and metrics to demonstrate the impact of the work.","More details about the specific technologies used in each project would be beneficial, especially versions and specific libraries.","The resume could benefit from elaborating on the software development methodologies used, such as Agile or Scrum."],"createdAt":"2025-12-07 02:06:24.307"},{"id":"cmiv51xr80001jl04gy2747jm","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":82,"duration":8,"completed":true,"improvements":["The resume could benefit from stronger quantification of achievements, such as specifying the scale of applications developed or the number of users impacted.","More detail on the specific technologies and methodologies used in each project would be beneficial.","The description of the \"Technical Support Intern\" role could be more focused on technical skills relevant to software engineering."],"createdAt":"2025-12-07 03:03:52.101"},{"id":"cmiv5jrer0001jo042p9me682","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":5,"completed":true,"improvements":["The resume could benefit from more specific details about the technologies used in each project and role.","The descriptions of responsibilities should be rephrased to emphasize accomplishments and quantifiable results whenever possible.","The projects section needs more context; clarify the purpose of each application and the problem it solves."],"createdAt":"2025-12-07 03:17:43.683"},{"id":"cmiv5osca0003jo04zub14irj","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume should include more specific details about the technologies used in each project and role.","The descriptions of projects and experiences could be more concise and focused on the technical aspects.","The resume should quantify accomplishments whenever possible to demonstrate the impact of the candidate's work."],"createdAt":"2025-12-07 03:21:38.171"},{"id":"cmiv6uiuf0001ky04xhnnis6r","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":6,"completed":true,"improvements":["The resume needs stronger quantification of accomplishments in each role, focusing on measurable impact.","The descriptions of project responsibilities could be more specific, showcasing a deeper understanding of the software development lifecycle.","The resume could benefit from tailoring the descriptions to match the specific requirements of target Software Engineer roles."],"createdAt":"2025-12-07 03:54:05.415"},{"id":"cmiv73hnb0001l104nwtsckb6","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":80,"duration":11,"completed":true,"improvements":["The resume should focus more on quantifiable results and less on descriptions of responsibilities.","The \"Research Assistant\" experience should be tailored to highlight transferable skills relevant to software engineering, such as problem-solving or data analysis.","The resume could benefit from a stronger emphasis on testing methodologies and code quality practices."],"createdAt":"2025-12-07 04:01:03.767"},{"id":"cmiv7ezie0001lb0445r9h0u3","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":10,"completed":true,"improvements":["The resume could benefit from more specific details about the software development methodologies used in each project or work experience.","The descriptions of responsibilities should be rephrased to emphasize accomplishments and quantify the impact of the work done.","The resume needs to showcase a deeper understanding of software engineering principles, such as testing, code quality, and design patterns."],"createdAt":"2025-12-07 04:10:00.134"},{"id":"cmiv7fmcz0003lb04gqgk7bjx","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":9,"completed":true,"improvements":["The resume needs more specific examples of coding contributions and software development lifecycle involvement.","The candidate should quantify achievements more consistently across all experiences, focusing on metrics relevant to software engineering, such as code quality, performance improvements, or feature delivery timelines.","The resume could benefit from highlighting contributions to team projects, emphasizing collaboration and communication skills within a software development context."],"createdAt":"2025-12-07 04:10:29.747"},{"id":"cmiv7gh6x0005lb042dwjajzo","userId":"cmd53yc3z000ajr04aqrme0th","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume lacks detailed descriptions of the technologies used and the specific contributions made in each role.","The descriptions of responsibilities are somewhat generic and could benefit from more specific details about the tasks performed.","The resume needs more focus on software engineering principles and practices, such as testing, code reviews, and version control."],"createdAt":"2025-12-07 04:11:09.705"},{"id":"cmk53gwl30006jp04iv52n3lw","userId":"cmk53fibu0000jp04el9lkka5","type":"resume","score":75,"duration":6,"completed":true,"improvements":["The resume lacks specific quantifiable results in the project descriptions, making it difficult to assess the impact of the candidate's contributions.","The descriptions of the leadership and extracurricular activities are not directly relevant to software engineering and should be refocused or minimized.","The skills section could be more targeted to the specific requirements of the desired Software Engineer role."],"createdAt":"2026-01-08 06:56:55.287"},{"id":"cmk53i7z80008jp04bykqano1","userId":"cmk53fibu0000jp04el9lkka5","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume lacks quantifiable results in the project descriptions; adding metrics to demonstrate the impact of the projects would be beneficial.","The descriptions of the experience at \"Adobe Student Ambassador Program\" and \"Planet Fitness\" are not directly relevant to Software Engineering and should be reframed to emphasize transferable skills or technical contributions.","The \"Skills\" section could be more specific, differentiating between proficiency levels or adding frameworks and libraries."],"createdAt":"2026-01-08 06:57:56.709"},{"id":"cmk5af5z10001l404f4a45z7a","userId":"cmk53fibu0000jp04el9lkka5","type":"resume","score":78,"duration":7,"completed":true,"improvements":["The resume should quantify the impact of projects and experiences whenever possible to demonstrate tangible results.","The descriptions of project responsibilities should be more focused on program management aspects, such as planning, coordination, and communication.","The resume lacks explicit mention of experience with project management tools or methodologies beyond Agile/Scrum."],"createdAt":"2026-01-08 10:11:31.454"},{"id":"cmkejy40d0006la044udbwtc0","userId":"cmkejv4yi0000la041j6j0wbd","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume lacks quantifiable results for the IT Intern role, such as specific improvements in efficiency or cost savings achieved.","The project descriptions could be more detailed, explaining the challenges faced and the solutions implemented.","The resume could benefit from mentioning specific testing frameworks or methodologies used in the projects."],"createdAt":"2026-01-14 21:48:07.501"},{"id":"cmkx9i6d80001jo04vs4px4rs","userId":"cmkx9427t0000jy04armqff38","type":"resume","score":78,"duration":14,"completed":true,"improvements":["The resume lacks quantifiable results in the \"Software Developer\" role, making it difficult to assess the impact of the candidate's work.","The candidate should tailor the resume to explicitly mention skills and experiences that align with the financial services industry, if applicable.","The resume should include more details about the specific responsibilities and accomplishments in the \"Software Developer\" role."],"createdAt":"2026-01-28 00:03:25.244"},{"id":"cml2o59jl0006jt04uf26bf2n","userId":"cml2o00r60000jt04ofwdefe4","type":"resume","score":75,"duration":9,"completed":true,"improvements":["The resume lacks quantifiable results in many areas, making it difficult to assess the impact of the candidate's contributions.","The descriptions of research assistant roles are vague and should be more specific about the candidate's responsibilities and achievements.","The projects section should emphasize the engineering design process and problem-solving skills involved."],"createdAt":"2026-01-31 18:52:07.954"},{"id":"cml72lsdw0003ky04twgn6w2q","userId":"cml72a7fn0000l504t2tfzli2","type":"resume","score":68,"duration":5,"completed":true,"improvements":["The resume lacks experience in lower-level languages like Ada or C, which might be relevant for the F-22's Operational Flight Program (OFP).","There is no explicit mention of experience in testing methodologies, unit testing, or integration testing, which are crucial for software quality in aerospace.","The descriptions of projects are somewhat vague and could benefit from more quantitative results or specific technical details."],"createdAt":"2026-02-03 20:47:58.197"},{"id":"cml8ctgre0001jp045lb7fxqg","userId":"cmbr717xw0000jx04cbiy1wxz","type":"resume","score":78,"duration":8,"completed":true,"improvements":["The resume lacks specific details about product management methodologies used (e.g., Agile, Scrum).","The descriptions of responsibilities are sometimes vague and could be strengthened with quantifiable results.","The impact of product decisions on key metrics (e.g., conversion rates, user engagement) needs to be more clearly articulated."],"createdAt":"2026-02-04 18:21:38.714"},{"id":"cmla5d23b0001i904ivpri9k9","userId":"cml9tlu2y0000l804hzlic8gr","type":"resume","score":72,"duration":5,"completed":true,"improvements":["The resume needs more quantifiable achievements to demonstrate the impact of the candidate's work.","The descriptions of the projects and experience should be more detailed, focusing on the specific engineering challenges and solutions implemented.","The resume should include specific examples of how the candidate's contributions improved product performance, user experience, or business outcomes."],"createdAt":"2026-02-06 00:28:28.247"},{"id":"cmli8gsvx0001la04n0is9uvc","userId":"cmli8bvt90000jr04i18ghqh2","type":"resume","score":60,"duration":6,"completed":true,"improvements":["The resume lacks any specific projects or experiences related to clocking, jitter analysis, or transresistor design, which are central to the target role.","There is no mention of relevant hardware tools or software used in clocking design or analysis, such as simulation software or measurement equipment.","The candidate's experience is largely focused on general engineering activities and lacks the depth required for a specialized role in clocking."],"createdAt":"2026-02-11 16:17:31.197"}]